[
  {
    "certificate": "/Assets/Images/Certificates/Cam-Asean-YLC-2025.png",
    "description": "The certificate of appreciation for WorldBridge Group in recognition of generous support and gracious hospitality in hosting CYLC and CAM-ASEAN students on recent field trip to the Peak on June 28, 2025"
  },
  {
    "certificate": "/Assets/Images/Certificates/HDAC-2025.jpg",
    "description": "The certificate of membership for OXLEY WORLDBRIDGE (CAMBODIA) as a member of The Housing Development Association of Cambodia"
  },
  {
    "certificate": "/Assets/Images/Certificates/Discussanddonation-2025.jpg",
    "description": "The certificate of appreciation for Neak Oknha Sear Rithy for donated 10,000 USD to Cambodian Oknha Association's Discuss and Donation 2025 under the topic “Together For Education”"
  },
  {
    "certificate": "/Assets/Images/Certificates/Certificate-of-National-Council.png",
    "description": "The certificate of appreciation for Neak Oknha Sear Rithy in support of the 46th Founding Anniversary of Solidarity Front for Development of Cambodian Motherland Commemorated"
  },
  {
    "certificate": "/Assets/Images/Certificates/CertificateOfAppreciationFromNavy.png",
    "description": "The certificate of appreciation for Neak Oknha Sear Rithy for donated 15,000,000 Riels in support of “Navy players who participated in the Dragon Boat, Canoe Boat, Kayak Boat and Rowing Boat Racing sport of H.E. Abhisantibindit Sar Sokha's Award at Waiko River.”"
  },
  {
    "certificate": "/Assets/Images/Certificates/LetterOfAppreciationCOA.jpg",
    "description": "The certificate of appreciation for Neak Oknha Sear Rithy for donated the Diamond Package of 10,000 USD in support of “Conversation Ceremony and Solidarity Dinner of the Cambodian Oknha Association and the Cambodian Housing Developers Association under the high presidency of Samdech Moha Borvor Thipadei HUN MANET, Prime Minister of the Kingdom of Cambodia on August 2, 2024”"
  },
  {
    "certificate": "/Assets/Images/Certificates/WBG-Certificate-Techo-Hospital-2024.png",
    "description": "The certificate of appreciation for Neak Oknha Sear Rithy for donated 25,000 USD in support of Techo Sen Koh Thom Hospital’s building construction."
  },
  {
    "certificate": "/Assets/Images/Certificates/Certificate MFAIC to WBG 3rd Oct 2023.jpg",
    "description": "The certificate of appreciation for Worldbridge Group for cosponsorship of the “Diplomacy-Business Friendship Gold Tournament”."
  },
  {
    "certificate": "/Assets/Images/Certificates/1k-Dollar-Certification.jpg",
    "description": "The certificate of appreciation for Neak Oknha Sear Rithy for donated 100,000 USD to “Techo Foundation” in support to Army Forces Year, 1978."
  },
  {
    "certificate": "/Assets/Images/Certificates/WBG-Certificate-Samdach-Techo-2022-01.png",
    "description": "The certificate of appreciation for Neak Oknha Sear Rithy for donated 50,000 USD to “Samdech Techo Young Volunteer Doctors Association” in support to offer free healthcare service and promote welfare for all people across the country."
  },
  {
    "certificate": "/Assets/Images/Certificates/WBG_2303_Web-Award_MR-Training&JobsCenter.png",
    "description": "The certificate of appreciation from Union of Youth Federations of Cambodia and MR Training & Jobs Center to Neak Oknha Sear Rithy for participate in “Career Orientation” Workshop as Sepcial Guest Speaker on the topice “Career and Business which one should we choose? What we need to prepare?” on 10th December 2022 at Mani Center KAMPUS Building."
  },
  {
    "certificate": "/Assets/Images/Certificates/WBG_Certificate_231020-1.png",
    "description": "The certificate of appreciation from Samdach Preak Moha Sangkha Reach to Neak Oknha Sear Rithy for donating USD 100,000 in support of Preah Sihanouk Raja Buddist University’s building construction."
  },
  {
    "certificate": "/Assets/Images/Certificates/sea-game-certificate.png",
    "description": "Neak Oknha Sear Rithy receives a certificate of appreciation from the VOLLEYBALL FEDERATION OF CAMBODIA for donating USD 20,000 to support SEA GAMES 2023 held in Cambodia."
  },
  {
    "certificate": "/Assets/Images/Certificates/IMG_3787.png",
    "description": "A Certificate of Appreciation from the Government for Oknha Sear Rithy, Chairman of the WorldBridge Group, has  in support of the Demining and Unexploded Ordnance Clearance Activities in Cambodia."
  },
  {
    "certificate": "/Assets/Images/Certificates/IMG_1394-scaled-e1652150049280.jpg",
    "description": "A Certificate of Appreciation from Entrepreneurship Development Fund for Oknha Sear Rithy, Chairman of the WorldBridge Group, has served as a member of the Board of Trustees of the Entrepreneur Development Fund in the first mandate."
  },
  {
    "certificate": "/Assets/Images/Certificates/ThankGiving_Covid19_050522.jpg",
    "description": "A Certificate of Appreciation from TYDA for Oknha Sear Rithy that has contributed resources to the association in the campaign against the spread of Covid-19."
  },
  {
    "certificate": "/Assets/Images/Certificates/PRESS-RELEASE_YCH-SIGNS-MOU-WITH-WORLDBRIDGE-FINAL-copy-scaled.jpg",
    "description": "Okhna Sear Rithy, Chairman of the WorldBridge Group, has contributed USD 5,000 to the  Chamkar Mon District Party Committee for the conduct of the election campaign."
  },
  {
    "certificate": "/Assets/Images/Certificates/Oxley_Diamond_Cambodia_Ltd_50000.jpg",
    "description": "Oxley Diamond (Cambodia) Co., Ltd. contributes USD50,000 to the Cambodian Red Cross on their 159th anniversary of World Red Cross Day on May 08."
  },
  {
    "certificate": "/Assets/Images/Certificates/Oxley_Emerald_Cambodia_Ltd_50000.jpg",
    "description": "Oxley Emerald (Cambodia) Co., Ltd. contributes USD50,000 to the Cambodian Red Cross on their 159th anniversary of World Red Cross Day on May 08."
  },
  {
    "certificate": "/Assets/Images/Certificates/Oxley_Gem_Cambodia_Ltd_50000-2.jpg",
    "description": "Oxley Gem (Cambodia) Co., Ltd. contributes USD50,000 to the Cambodian Red Cross on their 159th anniversary of World Red Cross Day on May 08."
  },
  {
    "certificate": "/Assets/Images/Certificates/neak-okhna-sear-rithy-donating-30000-TYDA-combating-COVID-19.jpg",
    "description": "Neak Okhna Sear Rithy receives a certificate of appreciation from the Commander of the Royal Cambodian Army for donating USD30,000 to support the army and the Samdech Techo Voluntary Youth Doctor Association (TYDA) in combating COVID-19."
  },
  {
    "certificate": "/Assets/Images/Certificates/oxley-gem-cambodia-contributes-cambodian-red-cross.jpg",
    "description": "Oxley Gem (Cambodia) Co., Ltd. contributes USD50,000 to the Cambodian Red Cross on their 158th anniversary of World Red Cross Day on May 08."
  },
  {
    "certificate": "/Assets/Images/Certificates/oxley-emerald-cambodia-contributes-cambodian-red-cross.jpg",
    "description": "Oxley Emerald (Cambodia) Co., Ltd. contributes USD50,000 to the Cambodian Red Cross on their 158th anniversary of World Red Cross Day on May 08."
  },
  {
    "certificate": "/Assets/Images/Certificates/oxley-diamond-cambodia-contributes-cambodian-red-cross.jpg",
    "description": "Oxley Diamond (Cambodia) Co., Ltd. contributes USD50,000 to the Cambodian Red Cross on their 158th anniversary of World Red Cross Day on May 08."
  },
  {
    "certificate": "/Assets/Images/Certificates/kerry-worldbridge-logistics-contributes-cambodian-red-cross.jpg",
    "description": "Kerry WorldBridge Logistics (Cambodia) Co., Ltd. contributes USD10,000 to the Cambodian Red Cross on their 158th anniversary of World Red Cross Day on May 08."
  },
  {
    "certificate": "/Assets/Images/Certificates/WBG-chairman-new-title-neak-oknha.jpg",
    "description": "Congratulations to Oknha Sear Rithy, Founder and Chairman of the Board of the WorldBridge Group on the occasion of His Majesty King Norodom Sihamoni conferred him the title of “Neak Oknha”."
  },
  {
    "certificate": "/Assets/Images/Certificates/wbg-vaccine-donation.jpg",
    "description": "Okhna Sear Rithy, Chairman of the WorldBridge Group, has contributed USD 200,000 to the Royal Government Cambodia in purchasing of COVID-19 vaccine to our Cambodians people! Okhna also received a letter of thanks from Samdech Akka Moha Sena Padei Techo Hun Sen, Prime Minister."
  },
  {
    "certificate": "/Assets/Images/Certificates/contribution-for-win-win-monument-construction.jpg",
    "description": "Okhna Sear Rithy and Lok Chumteav, receive a letter of appreciation from Samdech Pichey Sena Tea Banh, Deputy Prime Minister and Minister of National Defense and Chairman of the Construction Committee for Win-Win Monument, for contributed $10,000 to the construction of the new Win-Win Monument in Koh Kong province."
  },
  {
    "certificate": "/Assets/Images/Certificates/red-cross-certificate-for-oxley-gem-2020.jpg",
    "description": "A Certificate of Appreciation from Cambodia Red Cross for Oxley Gem (Cambodia) Co., Ltd., which has contributed USD 100,000.00 to celebrate the 157 Anniversary of the International Red Cross."
  },
  {
    "certificate": "/Assets/Images/Certificates/red-cross-certificate-for-oxley-emerald-2020.jpg",
    "description": "A Certificate of Appreciation from Cambodia Red Cross for Oxley Emerald (Cambodia) Co., Ltd., which has contributed USD 50,000.00 to celebrate the 157 Anniversary of the International Red Cross."
  },
  {
    "certificate": "/Assets/Images/Certificates/edc-certificate-2020.jpg",
    "description": "Okhna Sear Rithy has contributed $10,000 to patrol soldiers that has been on duty protecting Ta Mon Temple & Ta Krobei Temple at Bonteay Meanchey Province."
  },
  {
    "certificate": "/Assets/Images/Certificates/support-covid19-2020.jpg",
    "description": "Okhna Sear Rithy has contributed $100.000 in the campaign against Covid 19"
  },
  {
    "certificate": "/Assets/Images/Certificates/sankranta-preyveng-2019.jpg",
    "description": "Oknha Sear Rithy has contributed $1000 in Sangkran Event at Prey Veng Province."
  },
  {
    "certificate": "/Assets/Images/Certificates/oxley-gem-2019.jpg",
    "description": "Oxley Gem Co., Ltd had contributed $40,000 to build 10 houses for disable retired solider at the Disable Soldier Center 317 Techo Phnom Chhat."
  },
  {
    "certificate": "/Assets/Images/Certificates/worldbridge-group-2017.jpg",
    "description": "Okhna Sear Rithy has contributed $20,000 to Reseach Department of Ministry of National Defense."
  },
  {
    "certificate": "/Assets/Images/Certificates/excellence-program-2017.jpg",
    "description": "Oknha Sear Rithy was a panelist in the Excelence Program organized by Securities and Exchange Commission of Cambodia."
  },
  {
    "certificate": "/Assets/Images/Certificates/cambodia-property-awards-2016.jpg",
    "description": "Congratulation to Oknha Sear Rithy, Chairman of WorldBridge Land (Cambodia Co., Ltd), that had won Cambodia Property Award the Winner of the Real Estate Personality of the Year 2016."
  },
  {
    "certificate": "/Assets/Images/Certificates/sponsorship-certificate-2016.jpg",
    "description": "Oknha Sear Rithy has contributed $10.000 to Techo Voluntary Youth Doctor Association in order to provide free health care to local people in the community."
  },
  {
    "certificate": "/Assets/Images/Certificates/cht-awards-2016.jpg",
    "description": "Oknha Sear Rithy received CHT Awards 2016 of being an Outstanding Leader and Great Organization in his outstanding achievement and contribution to the Cambodia and Global Society."
  },
  {
    "certificate": "/Assets/Images/Certificates/red-cross-certificate-2015.jpg",
    "description": "A Certificate of Appreciation from Cambodia Red Cross for Oknha Sear Rithy that has contributed $5000 to Red Cross Cambodia in the 152 years Anniversary of the International Red Cross."
  },
  {
    "certificate": "/Assets/Images/Certificates/red-cross-2013.jpg",
    "description": "A Certificate of Appreciation from Cambodia Red Cross for Oknha Sear Rithy that has contributed $5000 to Red Cross Cambodia in the 150 years Anniversary of the International Red Cross."
  }
]
