[
  {
    "titleId": "wbg043",
    "title": "Bridge Bank signs partnership to offer better benefits for their Visa card users",
    "des": [
      "Bridge Bank Plaza Premium Lounge, Shangri-La Hotel and Singapore Medical Centre (SGMC) have signed a Memorandum of Understanding (MoU) to enhance and provide a more convenient, richer and more private experience to Bridge Bank cardholders.",
      "This collaboration demonstrates the evolution of consumer financial services and is moving towards full technological modernization. This initiative not only enhances the global financial services infrastructure, but also provides a convenient, seamless, innovative and private experience. This is a great change to the world with financial services without having to carry personal cash, offering special privileges around the world such as travel, shopping and many benefits, encouraging financial service users to have flexibility and civil freedom to go wherever they want.",
      "Mr. Richard Liew, CEO of Bridge Bank, said, “The partnership with Plaza Premium Lounge, the 5-star Shangri-La Hotel and Singapore Medical Centre (SGMC) provides customers with true confidence, comfort, safety and well-being. With the Plaza Premium Lounge, customers can access the lounge for free 8 times a year or unlimited access depending on the card type at more than 80 airports worldwide, offered by Plaza Premium Lounge.”",
      "Mr. Richard added that Bridge Bank cardholders can go for an annual health check-up at the Singapore Medical Center, which provides Singapore-standard medical care to Cambodians. In addition, you can enjoy special privileges to access the 5-star Shangri-la Resort and Hotel, which offers domestic and international travel privileges with a luxurious hospitality experience. You can also enjoy a 15% discount on room rates, dining and other services at Shangri-La in Phnom Penh, Cambodia.",
      "To apply for a card, customers can visit any of the nearest Bridge Bank branches to receive a warm welcome and advice from experts, or can contact our 24/7 customer service number 098 202 999.",
      "“This collaboration demonstrates our shared commitment to providing customers with value beyond everyday payment transactions,” said Lisa Sargent, Cambodia Visa’s Managing Director.",
      "She said that by using Visa's global payments, the experience for Visa card users is becoming smoother, easier, and they are receiving leading benefits, both in Cambodia and around the world."
    ],
    "date": "July 04, 2025",
    "thumbnail": "../assets/images/news/bridgebankvisa_01.png",
    "images": [
      "bridgebankvisa_01.png",
      "bridgebankvisa_02.jpg",
      "bridgebankvisa_03.jpg",
      "bridgebankvisa_04.jpg",
      "bridgebankvisa_05.jpg"
    ]
  },
  {
    "titleId": "wbg042",
    "title": "Oknha Sea Rithy, Vice President of the Cambodian Oknha Association, and Lork Chomtev (WorldBridge Group) donated $110,000 on the occasion of the 162nd anniversary of World Red Cross and Red Crescent Day, May 8, 2025.",
    "des": [
      "Neak Oknha Sear Rithy, Vice President of the Cambodian Oknha Association, and Lork Chomtev (WorldBridge Group) donated US$110,000 to the Cambodian Red Cross on the occasion of the 162nd anniversary of World Red Cross and Red Crescent Day on May 8, 2025, and the 70th anniversary of the Cambodian Red Cross, under the theme 'Together, volunteer for a healthy and climate-resilient community.'",
      "Oknha Sear Rithy, Vice President of the Cambodian Oknha Association, and Lork Chomtev (WorldBridge Group) have always contributed funds to the Cambodian Red Cross every year for May 8th. In the past, they have also contributed funds to support various campaigns of the Royal Government, as well as to support many other charitable programs.",
      "The participation in financial and material support through the Cambodian Red Cross is truly valuable in promoting a cultural spirit of sharing, which is a link between philanthropists and beneficiaries."
    ],
    "date": "April 25, 2025",
    "thumbnail": "../assets/images/news/red-cross-2025.png",
    "images": [
      "red-cross-2025.png"
    ]
  },
  {
    "titleId": "wbg041",
    "title": "Neak Oknha Kith Meng appoints Neak Oknha Sear Rithy as Senior Advisor to the Cambodian Chamber of Commerce",
    "des": [
      "Neak Oknha Kith Meng, President of the Cambodian Chamber of Commerce and Chairman of the ASEAN Business Advisory Council for Cambodia, on April 25, 2025, issued a decision to appoint Neak Oknha Sear Rithy, Chairman of the Board of Directors of WorldBridge Group, as a Senior Advisor to the Cambodian Chamber of Commerce for the 5th mandate.",
      "Neak Oknha Sear Rithy is a prominent businessman in Cambodia who has been in business since 1992. Neak Oknha owns the 200-meter-high 55-story skyscraper The Peak, located near Koh Pich Island, with an investment of approximately $580 million, and “WorldBridge Stadium Village” worth over $200 million. Neak  Oknha owns approximately 30 large companies in various sectors, especially in real estate, logistics, and transportation, including Bridge Bank, which was officially launched in June 2023. Neak Oknha also currently serves as the Vice President of the Cambodian Housing Developers Association and the Vice President of the Cambodian Oknha Association in charge of public and international relations.",
      "Please be informed that the Cambodian Chamber of Commerce was established in 1995, with connections throughout the country as well as regional and global partners. Currently, there are 18 Cambodian Chambers of Commerce, including provincial and capital chambers of commerce, under the Cambodian Chamber of Commerce.",
      "The Chamber of Commerce is a non-profit organization whose membership is voluntary and represents and protects the interests of the private sector in the fields of commerce, industry, handicrafts, services and agriculture, by acting to serve the national economy within its jurisdiction and throughout the country."
    ],
    "date": "April 25, 2025",
    "thumbnail": "../assets/images/news/Neak_Oknha_position_01.jpg",
    "images": [
      "Neak_Oknha_position_01.jpg",
      "Neak_Oknha_position.jpg",
      "Neak_Oknha_position_02.jpg"
    ]
  },
  {
    "titleId": "wbg040",
    "title": "Neak Oknha Sear Rithy, Chairman of the Board of Directors of WorldBridge Group, partners with a well-known and largest company in Poland to increase food processing capacity in Cambodia.",
    "des": [
      "LipCo Foods, a prominent food processing company from Poland, and WorldBridge Group, a leading company in Cambodia, have officially signed a Memorandum of Understanding (MoU) to explore further discussions and collaboration opportunities in the food processing sector.",
      "The signing ceremony was held in the presence of Mr. César Lipka, CEO of LipCo Foods, and Neak Oknha Sear Rithy, Chairman of the Board of Directors of WorldBridge Group, on January 27, 2025 in Phnom Penh, with executives of both parties also attending to witness the signing ceremony.",
      "LipCo Foods is a leading Polish group of companies specializing in food processing, formed by the merger of various brands and specialized divisions from the SuperDrop and CPF Poland Groups.",
      "LipCo Foods offers a wide range of high-quality food products, focusing on sustainability and customer satisfaction in the global market. They are currently one of the largest producers in Europe and the largest in Poland.",
      "The partnership aims to leverage the strengths of both organizations and enhance LipCo’s Cambodian food processing capabilities and WorldBridge Group’s extensive local market knowledge, bringing innovative and unique products to the Cambodian market.",
      "“This partnership is an important step forward in promoting the food processing sector in Cambodia, I am excited to work with LipCo Foods to explore new ways for growth and development.” said Neak Oknha Sear Rithy.",
      "This memorandum of understanding is a foundation for future discussions and initiatives that will contribute to the development of the food processing industry in Cambodia.",
      "WorldBridge Group is a leading company in Cambodia with a diversified portfolio across transportation, real estate, financial services and more. Committed to driving economic growth and innovation, the company partners with global and regional stakeholders to deliver effective solutions across industries."
    ],
    "date": "January 25, 2025",
    "thumbnail": "../assets/images/news/WBG-LipCo001.jpg",
    "images": [
      "WBG-LipCo001.jpg",
      "WBG-LipCo002.jpg",
      "WBG-LipCo003.jpg",
      "WBG-LipCo004.jpg"
    ]
  },
  {
    "titleId": "wbg039",
    "title": "WorldBridge Group promotes Cambodia’s potential at WEF25",
    "des": [
      "WorldBridge Group highlighted Cambodia’s potential as an emerging growth market within ASEAN during the World Economic Forum Annual Meeting 2025 (WEF25) in Davos, Switzerland.",
      "Neak Oknha Sear Rithy, Chairman of the WorldBridge Group of Companies, participated in WEF25, held from January 20-23. The event addressed five core themes: Industries in the Intelligent Age, Investing in People, Rebuilding Trust, Reimagining Growth, and Safeguarding the Planet, according to the company’s news release on Friday.",
      "These themes reflect the global discourse on navigating the complexities of an ever-evolving world.",
      "Neak Oknha Sear Rithy participated in several public and private sessions, including a discussion with Pham Minh Chinh, Prime Minister of Vietnam. Their dialogue emphasized the upcoming completion of a national data centre in June and highlighted four key pillars essential for the smart era: political stability, fast and sustainable economic development, environmental protection, and societal inclusivity. The integration of artificial intelligence into a national database was identified as a critical step for progress.",
      "In addition to engaging in high-level discussions, Neak Oknha Sear Rithy prioritized networking with ASEAN policymakers and business leaders throughout the meeting.",
      "He participated in key private sessions such as the exclusive Country Strategy Dialogue sessions for Thailand and Malaysia. These sessions featured heads of government, including Malaysian Prime Minister Anwar Ibrahim and Thai Prime Minister Paetongtarn Shinawatra.",
      "Another notable highlight was an ASEAN-themed, invite-only event titled ‘Journey Towards Unity: Lessons in Diplomacy and Regional Collaboration’, where leaders explored strategies for sustainable development and inclusive growth in the region.",
      "Neak Oknha Sear Rithy also attended the Governors Meeting: Supply Chain and Transport, a sector-focused session where he engaged with industry leaders. Discussions centered on mitigating macroeconomic disruptions caused by geopolitical shifts, advancing decarbonization to meet 2030 emission reduction targets, and leveraging technological advancements in AI and data to enhance supply chain efficiency.",
      "One of the exclusive events Neak Oknha Sear Rithy attended was IGWEL, an invite-only private session at Davos. The session, chaired by Kristalina Georgieva, Managing Director of the International Monetary Fund (IMF), gathered over 50 high-level participants, including business leaders, policymakers, and heads of international organizations. This year’s IGWEL theme was Viable Growth in a Volatile Era.",
      "Neak Oknha Sear Rithy’s presence at WEF25 underscores Cambodia’s growing prominence on the global stage, reaffirming the nation’s potential as a key growth market within ASEAN. His participation reflects WorldBridge Group’s dedication to engaging in critical discussions that shape the future of industries and economies worldwide."
    ],
    "date": "January 25, 2025",
    "thumbnail": "../assets/images/news/WBGWEF2025-02.jpg",
    "images": [
      "WBGWEF2025-01.jpg",
      "WBGWEF2025-02.jpg",
      "WBGWEF2025-03.jpg",
      "WBGWEF2025-04.jpg",
      "WBGWEF2025-05.png"
    ]
  },
  {
    "titleId": "wbg038",
    "title": "WorldBridge Group organized a discussion meeting with the Philippine Women's Business Council to explore Cambodia-Philippines business opportunities",
    "des": [
      "WorldBridge Group on January 23, 2025 welcomed the Philippine Women's Business Council for an introductory discussion aimed at exploring business collaboration and investment opportunities between Cambodia and the Philippines.",
      "The meeting, facilitated by the Philippine Embassy in Cambodia, was held on January 22 at Sombok Restaurant in Phnom Penh, attended by more than 35 senior executives and representatives from the Women’s Business Council of the Philippines (“WomenBizPH”), representing diverse industries in the Philippines, including agribusiness, aviation, logistics, healthcare, health, information technology, manufacturing, real estate, trade, and tourism.",
      "The discussions focused on fostering economic ties, knowledge sharing, and potential business partnerships in the Cambodian and Philippine markets. Several topics of interest were raised, including the possibility of investing in affordable housing, healthcare education, and youth education centers, joint efforts in tourism promotion, distribution of local products in both markets, among other new initiatives.",
      "Ms. Rosemarie Rafael, President of the Philippine Women’s Business Council, expressed optimism about the potential for cooperation and highlighted the importance of strengthening relationship between Cambodia and the Philippines. “This meeting serves as a valuable starting point to explore synergies and leverage collective strengths to drive business growth and empower women entrepreneurs in both markets,” she said.",
      "WorldBridge Group, led by Calvin Tse, Vice President of Business Development, along with executives from various sectors, presented Cambodia’s business and investment advantages and potential. The discussions emphasized the importance of promoting economic growth and identified opportunities for future cooperation.",
      "Both sides expressed their commitment to further engage through future business exchanges and cooperation projects with the aim of promoting bilateral trade and investment."
    ],
    "date": "January 24, 2025",
    "thumbnail": "../assets/images/news/WBG-PH001.jpg",
    "images": [
      "WBG-PH001.jpg",
      "WBG-PH002.jpg",
      "WBG-PH003.jpg",
      "WBG-PH004.jpg",
      "WBG-PH005.jpg"
    ]
  },
  {
    "titleId": "wbg037",
    "title": "Neak Oknha Sear Rithy: \"Condos in the WorldBridge Sport Village project have been bought by a group of investors\"",
    "des": [
      "WorldBridge Group's Chairman claimed that so far, all the condo buildings in the WorldBridge Sport Village project have been negotiated and purchased by investors after it opened for sale for a year, after the end of the 32nd SEA Games, which Cambodia hosted in May 2023.",
      "Neak Oknha Sear Rithy, Chairman of the Board of Directors of World Breed Group, said that in addition to condos, the project, which is developed on an area of ​​more than 6 hectares, also has 265 commercial houses, villas, townhouses and row houses that are being sold and handed over to customers gradually. WorldBridge Group executive believes that WorldBridge Sport Village will become a potential commercial area in Cambodia in the future, as the area is surrounded by schools, shopping malls, hospitals, entertainment venues, 5-star hotels and many other state ministries and institutions.",
      "Neak Oknha highlighted that after more than a year of sales, the condo buildings in the WorldBridge Sport Village project were sold to investors this week, but the investors paid his company in stages. However, Neak Oknha acknowledged that sales of condos and other houses in the project seemed to be slower than he was expected because during the project’s sales period after the 2023 SEA Games, the Cambodian real estate market seemed to be stagnant due to economic factors, the COVID-19 crisis, and other global crises. Neak Oknha believes that sales of condos or houses in the project will be better in 2025.",
      "At the same time, Neak Oknha Sear Rithy believes that the WorldBridge Sport Village project will remain a potential project because the area is a new development area and is surrounded by many large development projects such as universities, shopping malls, hospitals, entertainment venues, golf courses, 5-star hotels, and many other government ministries and institutions, especially various housing development companies have also plan towards developing the area. Neak Oknha assessed that in the next 2 to 3 years, when the real estate market in Cambodia returns to normal, the real estate market in the area will still be sellable and the best in the short term and in the future.",
      "Along with being located in a high-potential area, the WorldBridge Sport Village project also offers special installment payment terms to customers, with interest-free installments for up to 36 months and high flexibility. In addition to condos, the project, which is developed on an area of ​​6.4 hectares, also includes 265 houses, commercial buildings, villas, townhouses, and row houses, of which approximately 30% have been delivered to customers so far."
    ],
    "date": "January 21, 2025",
    "thumbnail": "../assets/images/news/WBG-WBSV001.jpg",
    "images": [
      "WBG-WBSV001.jpg",
      "WBG-WBSV002.jpg",
      "WBG-WBSV003.jpg"
    ]
  },
  {
    "titleId": "wbg036",
    "title": "Worldbridge Group collaborates with a major international company to boost investment in real estate and entertainment in Cambodia",
    "des": [
      "On December 20, 2024, Neak Oknha Sear Rithy's Worldbridge Group signed a memorandum of understanding with Tandem Partners, a diversified investment company with operations in France and Asia.",
      "The signing of this Memorandum of Understanding will provide an opportunity for both companies to jointly invest in two key sectors in Cambodia: real estate and entertainment, focusing on the luxury real estate market and brands, as well as unique entertainment experiences.",
      "The partnership was initiated during a mission led by His Excellency Sun Chanthol, Deputy Prime Minister and First Vice Chairman of the Council for the Development of Cambodia, and attended by Neak Oknha Sear Rithy, Chairman of the Board of Directors of WorldBridge Group, to France. During the mission, Worldbridge Group met with Tandem Partners to explore potential investment opportunities in Cambodia.",
      "In addition to looking for investment opportunities in the real estate sector, the two companies also aim to invest in the entertainment sector, such as organizing live performances, spectacular exhibitions, and more programs to promote Cambodia's culture and tourism sectors.",
      "Through this partnership, Tandem Partners will introduce new brands and innovative ideas to the Cambodian market, working with Worldbridge Group to enhance the quality and diversity of its existing properties and implement effective entertainment initiatives.",
      "Tandem Partners is a diversified investment group founded in 2015 that invests in France and Asia. Tandem Partners is actively involved in Cambodia through its advisory, Confluences, which specializes in market access and market access services for the Cambodian market and other Greater Mekong countries."
    ],
    "date": "December 21, 2024",
    "thumbnail": "../assets/images/news/WBG-TDP-02.jpg",
    "images": [
      "WBG-TDP-01.jpg",
      "WBG-TDP-02.jpg",
      "WBG-TDP-03.jpg",
      "WBG-TDP-04.jpg",
      "WBG-TDP-05.jpg"
    ]
  },
  {
    "titleId": "wbg035",
    "title": "The 5-Star Shangri-La Hotel, worth $140 million. Soft-Opening in Cambodia.",
    "des": [
      "The 5-star Shangri-La Phnom Penh, with an investment value of approximately US$140 million, was inaugurated for trial operation in Cambodia under the chairmanship of His Excellency Huot Hak, Minister of Tourism, on December 15, 2024. The 5-star hotel, part of The Peak skyscraper project located in the Koh Pich, is scheduled to officially open in early 2025, with the expectation of becoming a hotel offering Asian-style hospitality.",
      "Mr. Ody Odayappan, General Manager of Shangri-La Phnom Penh, said that through the recently inaugurated Shangri-La Phnom Penh, it will be a part of attracting more tourists to visit Cambodia, while the luxury hotel also sells products made in Cambodia, which is an important contribution to creating jobs for some Cambodian citizens. According to the manager, the pilot launch of this 5-star hotel is being carried out in stages and the official inauguration will take place at the end of the first quarter of 2025.",
      "Shangri-La Hotel Phnom Penh is a famous brand of the multinational hospitality company Shangri-La Hotel Group, which focuses on providing services in the hospitality sector in Asia alone and is becoming the latest new 5-star hotel in Phnom Penh, with a building as high as 55 floors in the city, offering beautiful views of the Mekong River and the surrounding skyscrapers.",
      "This luxurious hotel has 303 rooms, the largest ballroom in the city, a variety of dining options, a stylish bar, a swimming pool and a fitness center. By combining modern luxury with Khmer culture, the hotel also offers Asian hospitality to national and international guests."
    ],
    "date": "December 18, 2024",
    "thumbnail": "../assets/images/news/WBG-SGL-01.jpg",
    "images": [
      "WBG-SGL-01.jpg",
      "WBG-SGL-02.jpg",
      "WBG-SGL-03.jpg",
      "WBG-SGL-04.jpg"
    ]
  },
  {
    "titleId": "wbg034",
    "title": "Neak Oknha Sear Rithy volunteers to be a servicer at a world-famous pizza restaurant on Koh Pich",
    "des": [
      "Neak Oknha Sear Rithy, Chairman of WorldBridge Group, has volunteered to work as a food service worker at Little Caesars®, a world-famous pizza restaurant that recently opened on Koh Pich.",
      "Little Caesars® Pizza, one of the world’s largest pizza brands, has officially opened its first restaurant in Cambodia.",
      "Not only is it the first Little Caesars® Pizza in Cambodia, but it also features Cambodia’s first Drive-Through Pizza service, offering customers HOT-N-READY® fresh pizzas that are convenient, quality, and affordable.",
      "The key to the Little Caesars® Pizza experience is HOT-N-READY®, which ensures that customers can walk in and get a hot, delicious pizza right away without having to wait or order in advance.",
      "This makes Little Caesars® Pizza the perfect choice for busy families, students, and working professionals looking for quality food on the go.",
      "Whether enjoying a meal in a restaurant or taking a pizza to eat at home, customers will have a freshly made pizza waiting for them at all times.",
      "Little Caesars®’s core values ​​are focused on convenience, family-friendly pricing, and a commitment to providing quality service to its customers. When customers walk into a store, they can get their pizza delivered right away.",
      "With HOT-N-READY® Pizza, the restaurant also offers delivery via foodpanda, WOWNOW, E-GetS, and Nham24, ensuring that customers can enjoy their freshly made pizza at home or on the go.",
      "Little Caesars® Pizza is committed to maintaining the highest standards by offering pizza that is not only freshly made, but also at the most affordable prices.",
      "The opening of its first restaurant in Koh Pich is just the beginning, with a second location in the pipeline and scheduled to open in early 2025.",
      "The opening of the first restaurant in Cambodia was held on November 10, 2024 in Koh Pich, attended by distinguished guests including Ms. Bridgette L. Walker, Chargé d’Affaires of the U.S. Embassy in Cambodia, and Mr. Andres De Robina, Vice President, Little Caesars Brands International.",
      "Moreover, Little Caesars®, which has entered the Cambodian market, is the 29th country of Little Caesars® operations worldwide, which was led by Neak Oknha Sear Rithy, Chairman of Worldbridge Group."
    ],
    "date": "November 20, 2024",
    "thumbnail": "../assets/images/news/wbg-littlecaesars01.png",
    "images": [
      "wbg-littlecaesars01.png",
      "wbg-littlecaesars02.png",
      "wbg-littlecaesars03.png",
      "wbg-littlecaesars04.png",
      "wbg-littlecaesars05.png",
      "wbg-littlecaesars06.png",
      "wbg-littlecaesars07.png"
    ]
  },
  {
    "titleId": "wbg033",
    "title": "Innovative insights on ASEAN entrepreneurship highlighted at Global Knowledge Forum",
    "des": [
      "The World Knowledge Forum 2024, held at Inspire Entertainment Resort, began with a speech under the highest presidency of Samdech Akka Moha Sena Padei Techo Hun Sen, President of the Senate of the Kingdom of Cambodia. The forum focused on the exchange of views on the topic 'Towards Unity'.",
      "On that solemn occasion, Neak Oknha Sear Rithy, Chairman of the Board of Directors of WorldBridge Group, also accompanied Samdech Techo along with many other Cambodian delegations. Nonetheless, Neak Oknha Sear Rithy has been actively involved as a speaker and received an award from the World Knowledge Forum, which has been organized for the past three days.",
      "The presence of the Cambodian delegation, led by Samdech Techo Hun Sen, demonstrates Cambodia's growing influence and focus on promoting international partnerships and exchanging knowledge on the international stage.",
      "Neak Oknha Sear Rithy participated in a very interesting Q&A session and Neak Oknha shared a deep understanding of ASEAN entrepreneurship. The Neak Oknha meeting on 'ASEAN Entrepreneurs' discusses various topics, including opportunities for future growth in the technology region and the changes brought by the evolving digital in ASEAN.",
      "From the outstanding achievements and leadership of Neak Oknha Sear Rithy, it urged Neak Oknha to receive the 9th ASEAN Entrepreneur Award 2024 at the Q&A session of the World Knowledge Forum. This award recognizes the creative and dynamic business ventures of Neak Oknha Sear Rithy in the ASEAN region.",
      "'We are thrilled to have Neak Oknha Sear Rithy join us at this year's forum', said Kim Jae-shin, Secretary-General of the ASEAN-Korea Center.",
      "'Neak Oknha Sear Rithy's vision for future growth, sustainability and trends presents many possibilities for those looking to move forward in the region.'",
      "The World Knowledge Forum is a leading international conference dedicated to transforming Korea into a knowledge-driven country. Bringing together a diverse group of thought leaders, experts and innovators, the forum has become one of the fastest growing knowledge sharing events worldwide since its inauguration in 2000."
    ],
    "date": "September 13, 2024",
    "thumbnail": "../assets/images/news/wbggkf001.jpg",
    "images": [
      "wbggkf001.jpg",
      "wbggkf002.jpg",
      "wbggkf003.jpg",
      "wbggkf004.jpg",
      "wbggkf006.jpg",
      "wbggkf005.jpg"
    ]
  },
  {
    "titleId": "wbg032",
    "title": "Neak Oknha Sear Rithy ventures together with a large Thai company to establish a platform for Digital Asset Services in Cambodia",
    "des": [
      "Neak Sear Rithy's WorldBridge Group on August 28, 2024, signed a joint venture agreement with Bitkub (Bitkub Capital Group Holdings), a Thai-based leading company in digital assets industry to create a platform for digital assets that can operate safely for trading in Cambodia.",
      "The signing of the joint venture between Neak Oknha Sear Daniel, Executive Director of WorldBridge Group and Mr. Sakolkorn Sakavee, President of Bitkub Capital Group Holdings, was presided over by H.E. Sou Socheat, Director General of the Securities and Exchange Commission of Cambodia, Neak Oknha Sear Rithy, Chairman of the Board of Directors of WorldBridge Group and Jirayut Srupsrisopa, Founder and CEO of Bitkub Capital Group Holdings.",
      "As Bitkub, the market leader and largest consumer in Thailand, along with the WorldBridge Group's well-rounded understanding of the business landscape in Cambodia, this venture has become an important opportunity to accelerating the adoption of various technologies, as both companies see the importance of digital assets and blockchain innovation.",
      "Please note that this newly formed joint venture will aim to introduce the benefits of Web3 and blockchain technologies to improve financial and digital asset solutions for the people of Cambodia."
    ],
    "date": "August 29, 2024",
    "thumbnail": "../assets/images/news/WBGBT001.jpg",
    "images": [
      "WBGBT001.jpg",
      "WBGBT002.jpg",
      "WBGBT003.jpg",
      "WBGBT004.jpg",
      "WBGBT005.jpg"
    ]
  },
  {
    "titleId": "wbg031",
    "title": "Neak Oknha Sear Rithy Collaborates with a Large Indonesian Real Estate Company to find investment opportunities in Cambodia.",
    "des": [
      "Neak Oknha Sear Rithy's WorldBridge Group on August 20, 2024 signed a Memorandum of Understanding (MoU) with Lippo Group (PT Lippo Karawaci) Tbk, Indonesia's leading real estate developer to establish cooperation for development projects in Cambodia. This is according to a press release from the WorldBridge Group.",
      "The signing took place in Jakarta, Indonesia between David Iman Santosa and Marshal Martinus, PT Lippo Karawaci Tbk Director and Neak Oknha Daniel Sear, Executive Director of WorrldBridge Group.",
      "According to the press release, the strategic relationship between the two companies aims to enhance the strength and common experience in the real estate sector to seek potential cooperation in various development projects throughout Cambodia.",
      "Lippo Group's extensive experience in sustainable large-scale real estate development combined with WorldBridge Group's in-depth understanding of the local real estate market and its networking, established an attractive combination for the achievement of significant joint ventures. The signing of this MoU is also in line with the Royal Government of Cambodia's ongoing efforts to attract foreign direct investment and promote Sustainable development as well.",
      "According to the press release, the signing of the memorandum of understanding took place after a in-depth discussion between Neak Oknha Sear Rithy and Mr. John Riady, CEO of Lippo Group during his last visit to Cambodia in February 2024.",
      "These discussions are focused mainly on understanding the real estate development in Kampot Province as well as other potential projects in Cambodia. The portfolio of the WorldBridge Group and its record of successful real estate development, including projects such as The Peak and The Bridge, make it an excellent partner for the company's expansion of Lippo Group into the Cambodia’s real estate market. The two companies will work together to identify mutually beneficial opportunities in new real estate development projects across Cambodia.",
      "The MoU with Lippo Group represents another milestone in the WorldBridge Group's continued commitment to contributing to Cambodia's sustainable development. The company looks forward to successful cooperation that will benefit both institutions and create a lasting positive impact for the people of Cambodia.",
      "Please note that WorldBridge Group is a leading company in Cambodia, established in 1992. With diverse interests in logistics, real estate, finance, hospitality and more, the Group has played a key role in Cambodia's economic growth and development. WorldBridge Group is committed to delivering excellence, innovation and sustainable value to its stakeholders and communities.",
      "In particular, Lippo Group is a well-known company in Asia with a wide range of interests in the real estate sector. Healthcare, hospitality, retail, finance and other utility services. In the real estate sector of Indonesia, the Group has a clear record of developing and operating many residential, commercial and industrial projects, including large towns such as Lippo village, etc."
    ],
    "date": "August 21, 2024",
    "thumbnail": "../assets/images/news/Indonesia-WBG.jpg",
    "images": [
      "Indonesia-WBG-001.jpg"
    ]
  },
  {
    "titleId": "wbg030",
    "title": "Cambodian business representative attends 'Summer Davos' World Economic Forum in China",
    "des": [
      "The annual meeting of the World Economic Forum, often referred to as the ‘Summer Davos’, kicked off on June 25, 2024 in Dalian, China, focusing on  ‘The Next Frontier for Development’. The three-day event was held in the presence of Chinese Premier Li Qiang, Prime Minister of Vietnam Pham Minh Chinh and Polish President Andrzej Duda.",
      "Among the 1,600 world leaders from nearly 80 countries who attended, Neak Oknha Sear Rithy, Chairman of the Board Director of Cambodia WorldBridge Group, also attended in this forum as well. As the only member of the World Economic Forum from Cambodia, Neak Oknha Sear Rithy will discuss a few key topics for the ASEAN region, including the digital economy, digital payments and workforce development. Neak Oknha Sear Rithy was also present at a meeting with His Excellency Pham Minh Chinh, Prime Minister of Vietnam and other prominent business figures from Asia, as well as an informal meeting of world leaders (IGWEL) in the lunch program. The World Economic Forum annually discusses the challenges and opportunities arising from the rapidly evolving global landscape. The gathering serves as an important platform for leaders from diverse sectors to collaborate and develop innovative solutions to drive global economic recovery.",
      "The event focuses on six key themes: the evolving global economy, China's role in the world, entrepreneurship in the AI ​​era, new frontiers for industry, investment in human resources and interconnection of natural, climate and energy.",
      "With a strong emphasis on collaboration and knowledge exchange, Summer Davos 2024 is ready to prepare for the future of global economic growth and development. The conference will be accessible to a global audience through more than 50 live sessions, including discussions on China's economic prospects and international cooperation in a more competitive world."
    ],
    "date": "June 26, 2024",
    "thumbnail": "../assets/images/news/SDWBG02.png",
    "images": [
      "SDWBG01.jpg",
      "SDWBG02.png",
      "SDWBG03.png"
    ]
  },
  {
    "titleId": "wbg029",
    "title": "Cambodia-Singapore Business Leaders breakfast to Strengthen Supply Chain Relationships",
    "des": [
      "HE Cham Nimmol, Minister of Commerce, and HE Chea Vuthy, Secretary General of the Council for Investment of Cambodia, presided over the Singapore-Cambodia Business Leaders' Breakfast this morning. The event was organized by Neak Oknha Sear Rithy, Chairman of the board director of WorldBridge Group, and Dr. Robert Yap, Chairman of the YCH Group and Chairman of SCALA.",
      "The Singapore-Cambodia Business Leaders Breakfast is a forum for business leaders from both countries to discuss and explore further collaboration and growth opportunities, especially the presence of logistics-related businesses. The event highlighted the strong economic ties between Singapore and Cambodia and the potential for mutual benefits in the supply chain and the logistics sector.",
      "After having breakfast, to boost supply chain and logistics sector in Cambodia, Supply Chain and Logistics Academy (SCALA) Singapore and PPLC Superport & Industrial Co., LTD. (Cambodia) Signed a Memorandum of Understanding (MoU) to provide comprehensive training to up to 300 Cambodian trainees in Singapore, equipping them with the skills and knowledge they need to be able to work in the supply chain and the fast-growing transportation industry. The course will cover areas including business operations, business development, operational optimization, technology and global supply chain contexts.",
      "The MoU was signed by Mr. Allen Dodgson Tan on behalf of PPLC and Mr. Ian Dyason, Executive Director of SCALA in the presence of HE Chamnimol and HE Chea Wutty. After the signing of the MoU, the representatives of the two companies were handed over to each other under the highest presidency of His Excellency Hun Manet, Prime Minister of the Kingdom of Cambodia under the Singapore-Cambodia Business Forum.",
      "Ian Dyason, CEO of SCALA, said: 'This MOU is a milestone in our commitment to developing Cambodia's supply chain and logistics sector.' Through this partnership, we will provide an opportunity for the Cambodian logistics sector to train its workforce in Singapore, providing them with the skills needed to grow in this vibrant industry.",
      "Mr. Allen Dodgson Tan added, ‘This partnership with SCALA is a testament to PPLC's commitment to growth and development in the Cambodian logistics industry. We are confident that this cooperation will have a long-term positive impact on Cambodia's supply chain and logistics capacity.’"
    ],
    "date": "June 19, 2024",
    "thumbnail": "../assets/images/news/CGWBG01.jpg",
    "images": [
      "CGWBG02.jpg",
      "CGWBG03.jpg",
      "CGWBG04.jpg",
      "CGWBG05.jpg",
      "CGWBG06.jpg",
      "CGWBG07.jpg"
    ]
  },
  {
    "titleId": "wbg028",
    "title": "WorldBridge Group Introduces Affordable Industrial and Housing Areas on Diplomatic Visit",
    "des": [
      "On May 30, 2024, WorldBridge Group, a leading company in Cambodia, organized a special diplomatic visit of its industrial and residential development in Phnom Penh. The visit was led by Neak Oknha Sear Rithy, Chairman of the Board of Directors of WorldBridge, and was attended by ambassadors and members of embassies of many countries.",
      "This diplomatic visit demonstrates the WorldBridge Group's commitment to sustainable and environmental development in Cambodia through its potential subsidiaries, including the WorldBridge Small and Medium Enterprise Group. (WBID) and Affordable Housing, Serei Mongkul Satellite City and Kerry WorldBridge Supply Chain Special Economic Zone.",
      "",
      "- Small and Medium Enterprises (WBID) :",
      "WorldBridge has established the WBID Small and Medium Enterprise Group to support the growth of Cambodia's small and medium enterprises (SMEs) and to enable small and medium enterprises to access affordable production facilities, infrastructure and business support services . This venue is also the location of Ibis Rice, the first tenant.",
      "",
      "- Affordable Housing, Serey Mongkul Satellite City :",
      "WorldBridge Affordable Housing is a pioneering project that aims to provide high quality and affordable housing to Cambodia's low and middle income people. The project has completed the construction of 2,457 units (of which more than 1,900 homes have already been handed over to clients) and is designed to create a sustainable and livable community.",
      "",
      "- Kerry WorldBridge :",
      "Kerry WorldBridge is a joint venture between Kerry Logistics and the WorldBridge Group. The company has become a supply chain solution, including international freight, warehousing and distribution. The equipment is equipped to handle a wide range of products, including construction materials, vehicles, wine and spirits, clothing, fashion and techonology goods. The newly launched refrigeration equipment at Kerry WorldBridge is the lastest technology in Cambodia that serves for international renowned brands. Kerry WorldBridge has focused more on agricultural promotion, value-added processing, export consolidation and quality control.",
      "",
      "'We are proud to present our development to the diplomatic community,' and 'It is a testament to our commitment to investing in the future of Cambodia and to create employment opportunities for all Cambodians.' said Neak Oknha Sear Rithy, Chairman of the Board of Directors of WorldBridge Group.",
      "The diplomatic visit was a success, giving participants a glimpse of the WorldBridge Group's contribution to economic and social development of Cambodia.",
      "Please note that WorldBridge Group is a leading company in Cambodia with a diverse portfolio of real estate, construction, logistics and hospitality. The company is committed to sustainable and inclusive development in Cambodia."
    ],
    "date": "June 04, 2024",
    "thumbnail": "../assets/images/news/WDV032.jpg",
    "images": [
      "WDV001.jpg",
      "WDV002.jpg",
      "WDV003.jpg",
      "WDV004.jpg",
      "WDV005.jpg",
      "WDV006.jpg",
      "WDV007.jpg",
      "WDV008.jpg",
      "WDV009.jpg",
      "WDV010.jpg",
      "WDV011.jpg",
      "WDV012.jpg",
      "WDV013.jpg",
      "WDV014.jpg",
      "WDV015.jpg",
      "WDV016.jpg",
      "WDV017.jpg",
      "WDV018.jpg",
      "WDV019.jpg",
      "WDV020.jpg",
      "WDV021.jpg",
      "WDV022.jpg",
      "WDV023.jpg",
      "WDV024.jpg",
      "WDV025.jpg",
      "WDV026.jpg",
      "WDV027.jpg",
      "WDV028.jpg",
      "WDV029.jpg",
      "WDV030.jpg",
      "WDV031.jpg",
      "WDV032.jpg",
      "WDV034.jpg"
    ]
  },
  {
    "titleId": "wbg027",
    "title": "Neak Oknha Sear Rithy donated $110,000 USD to the Cambodian Red Cross",
    "des": [
      "Neak Oknha Sear Rithy, Chairman and CEO of the World Bridge Group, and Lok Chumteav Hak Vannara have donated $110,000 USD to the Cambodian Red Cross on the occasion of the 161st Anniversary of the World Red Cross and Red Crescent Day, May 8, 2024.",
      "Neak Oknha Sear Rithy and Lok Chumteav regularly donate to the Cambodian Red Cross every year and also support various of the Royal Government’s campaigns as well as other charitable programs.",
      "Please be informed that the 161st Anniversary of the World Red Cross and Red Crescent Day, May 8, 2024 will be celebrated under the theme 'Together with the Cambodian Red Cross for a healthy and climate resilient community'",
      "Funds raised from philanthropists, the National Association shall be use to continue provide humanitarian services, address challenges, strengthen community resilience and alleviate the suffering of the most vulnerable and vulnerable people in accordance with the fundamental principles of the International Red Cross and Red Crescent Movement."
    ],
    "date": "May 08, 2024",
    "thumbnail": "../assets/images/news/WBG_240508-01_FB.jpg",
    "images": [
      "WBG_240508-01_FB.jpg"
    ]
  },
  {
    "titleId": "wbg026",
    "title": "Samdech Sangkha Reach Bour Kry appreciates Neak Oknha Sear Rithy for the donation",
    "des": [
      "Samdech Preah Abhisiri Sokunthea Moha Sangkha Reach Bour Kry, Samdech Preah Moha Sangkha Reach of Dhammayutnikaya Commitee of Kingdom of Cambodia, issued a message appreciating Neak Oknha Sear Rithy, Chairman of Worldbridge  International Group, for donating $ 100,000 to contribute to the building construction of the Sihamoni Raja Buddhist University.",
      "“I would like to express my deep gratitude to Neak Oknha and Lok Chumteav for their generosity in donating USD $100,000 to help build the Sihamoni Raja Buddhist University’s Building.” said Samdech Preah Abhisiri Sokunthea Moha Sangkha Reach Bour Kry, Samdech Preah Moha Sangkha Reach of Dhammayutnikaya Commitee of Kingdom of Cambodia.",
      "A part from Neak Oknha Sear Rithy, many other Neak Oknha and Oknha who are members of the Cambodian Duke Association also donated for this building construction.",
      "According to the report from the Cambodian Duke Association, under the donation of Neak Oknha and Oknha, the association received more than 2.4 million US dollars, and these funds were already given to Samdech Preah Sangkhareach Bour Kry on October 20, 2022."
    ],
    "date": "October 24, 2022",
    "thumbnail": "../assets/images/news/Neak-Okhna-2.png",
    "images": [
      "Neak-oknha-sear-rithy-group-photo-768x576.jpeg"
    ]
  },
  {
    "titleId": "wbg025",
    "title": "WorldBridge Sport Village and Prince Bank sign a partnership to offer residential loans up to 80% for up to 25 years!",
    "des": [
      "WorldBridge Sport Village and Prince Bank sign a partnership to offer residential loans up to 80% for up to 25 years!",
      "Phnom Penh 09th September 2021 – WB Sport Village has announced a partnership with Prince Bank to offer their customers the Bank “Flexi Lending Loans” program for those who wish to invest in the project’s home and condo more convenient.",
      "For more information:",
      "Phone: 085 611 147 / 087 611 147",
      "Website: https://wbsportvillage.com"
    ],
    "date": "September 13, 2021",
    "thumbnail": "../assets/images/news/sportvilage02.jpeg",
    "images": [
      "sportvilage01.jpeg",
      "sportvilage02.jpeg",
      "sportvilage03.jpeg",
      "sportvilage04.jpeg",
      "sportvilage05.jpeg",
      "sportvilage06.jpeg",
      "sportvilage07.jpeg",
      "sportvilage08.jpeg",
      "sportvilage09.jpeg"
    ]
  },
  {
    "titleId": "wbg024",
    "title": "WorldBridge Sport Village and Phillip Bank sign a partnership to offer residential loans up to 85% for up to 25 years!",
    "des": [
      "WorldBridge Sport Village and Phillip Bank sign a partnership to offer residential loans up to 85% for up to 25 years!",
      "Phnom Penh 17th August 2021 – WB Sport Village has announced a partnership with Phillip Bank to offer their customers the Bank “Flexi Lending Loans” program for those who wish to invest in the project’s home and condo more convenient.",
      "Phillip Bank is the 5th largest bank to partner with the WB Sport Village project to provide the Bank “Flexi Lending Loans” program to customers for up to 85% with an interest rate of 7.99% and a mortgage loan Condos up to 70% with an interest rate of 8.5% of the project for up to 25 years.",
      "Neak Okhna Sear Rithy, Founder and Chairman of the WorldBridge Group, said, “The Flexi Lending Loan program between WB Sports Village and Phillip Bank is a win-win strategy in business with the most exclusive credit choices for the customers”.",
      "The most attractive part of the bank Flexi Lending Loans program is buying a condo has not required customers to have any collateral, as it is entirely signing a sale contract with the WB Sport Village.",
      "For more information:",
      "Phone: 085 611 147 / 087 611 147",
      "Website: https://wbsportvillage.com"
    ],
    "date": "August 24, 2021",
    "thumbnail": "../assets/images/news/worldbridgesportvillage12-e1629779287511.jpeg",
    "images": [
      "worldbridgesportvillage12-e1629779287511.jpeg",
      "worldbridgesportvillage11-1.jpeg",
      "worldbridgesportvillage1.jpeg",
      "worldbridgesportvillage10.jpeg",
      "worldbridgesportvillage9.jpeg",
      "worldbridgesportvillage8.jpeg",
      "worldbridgesportvillage7.jpeg",
      "worldbridgesportvillage6.jpeg",
      "worldbridgesportvillage5.jpeg",
      "worldbridgesportvillage4.jpeg",
      "worldbridgesportvillage3.jpeg",
      "worldbridgesportvillage2.jpeg"
      
    ]
  },
  {
    "titleId": "wbg023",
    "title": "WorldBridge Sport Village and CIMB Bank sign a partnership to offer residential loans",
    "des": [
      "WorldBridge Sport Village and CIMB Bank sign a partnership to offer residential loans up to 80%!",
      "Phnom Penh 22nd July 2021 – WB Sport Village has announced a partnership with CIMB Bank to offer their customers the Bank “Flexi Lending Loans” program for WB Sport Village Co., Ltd, a new project formally known as WorldBridge Sport Village (WBSV).",
      "This alliance allows both WB Sport Village and CIMB Bank customers to enjoy competitive rates of up to 80% loan size and a term of up to 25 years to own a house or condo.",
      "Neak Okhna Sear Rithy, Founder and Chairman of the WorldBridge Group, said, “The Flexi Lending Loan program between WB Sport Village and CIMB Bank is a win-win strategy in business with the most convenient and exclusive credit choices for the customers”.",
      "For more information:",
      "Phone: 085 611 147 / 087 611 147",
      "Website: https://wbsportvillage.com"
    ],
    "date": "July 9, 2021",
    "thumbnail": "../assets/images/news/mou-wbsv-cimb-2021-8.jpg",
    "images": [
      "mou-wbsv-cimb-2021-1.jpg",
      "mou-wbsv-cimb-2021-2.jpg",
      "mou-wbsv-cimb-2021-4.jpg",
      "mou-wbsv-cimb-2021-5.jpg",
      "mou-wbsv-cimb-2021-6.jpg",
      "mou-wbsv-cimb-2021-7.jpg",
      "mou-wbsv-cimb-2021-8.jpg",
      "mou-wbsv-cimb-2021-9.jpg",
      "mou-wbsv-cimb-2021-12.jpg",
      "mou-wbsv-cimb-2021-11.jpg",
      "mou-wbsv-cimb-2021-10.jpg",
      "mou-wbsv-cimb-2021-3.jpg"
    ]
  },
  {
    "titleId": "wbg022",
    "title": "WorldBridge Sport Village and Sathapana Bank sign partnership to offer special residential loan",
    "des": [
      "On July 09, 2021, at the Sofitel Hotel, WorldBridge Secure Logistics, a member of the WorldBridge Group will officially announce the rebranding of the company. Going forward, the company will operate under its new name of Brink’s WorldBridge Secure Logistics.",
      "Brink’s, the world’s largest secure logistics company, and its oldest (established in 1859), with its head office in the USA, established a joint venture with WorldBridge Secure Logistics, bringing a wide array of new security logistics and cash services to Cambodia. The rebranding ceremony will officially announce the name change and our future operations under the Brink’s colors and logo.",
      "Neak Okhna Sear Rithy stated, ‘this will allow us to take Cash-in-Transit to the next level. We will be able to provide new services like cash processing and overnight storage.’ Gary Freedman, Sub-Regional Manager -Southeast Asia for Brink’s stated, ‘Cambodia is a good fit for our overall strategy of expanding Brink’s services throughout Southeast Asia and the greater Asia-Pacific region."
    ],
    "date": "July 9, 2021",
    "thumbnail": "../assets/images/news/brinks-wbsl-rebranding-ceremony-2.jpg",
    "images": [
      "brinks-wbsl-rebranding-ceremony-1.jpg",
      "brinks-wbsl-rebranding-ceremony-2.jpg",
      "brinks-wbsl-rebranding-ceremony-3.jpg",
      "brinks-wbsl-rebranding-ceremony-4.jpg",
      "brinks-wbsl-rebranding-ceremony-5.jpg",
      "brinks-wbsl-rebranding-ceremony-6.jpg",
      "brinks-wbsl-rebranding-ceremony-7.jpg",
      "brinks-wbsl-rebranding-ceremony-8.jpg",
      "brinks-wbsl-rebranding-ceremony-9.jpg",
      "brinks-wbsl-rebranding-ceremony-10.jpg",
      "brinks-wbsl-rebranding-ceremony-11.jpg",
      "brinks-wbsl-rebranding-ceremony-12.jpg"
    ]
  },
  {
    "titleId": "wbg021",
    "title": "WorldBridge Sport Village and Sathapana Bank sign partnership to offer special residential loan",
    "des": [
      "Phnom Penh, 24th June 2021 – WB Sport Village Co., Ltd. and Sathapana Bank have announced the launch of their partnership to offer their customers the Bank’s “Flexi Lending Loan” program for WB Sport Village Co., Ltds’ new Project, formally known as WorldBridge Sport Village (WBSV).",
      "This alliance allows both WorldBridge Sport Village and Sathapana Bank’s customers to enjoy competitive rates, longer repayment period and higher loan amount, and fast approval.",
      "Sathapana’s “Flexi Lending Loan” program with WBSV allows customers to obtain a personal loan of up to US$200,000 and an unsecured credit card with available credit of up to US$10,000.",
      "Mr. Fung Kai Jin, Chief Executive Officer of Sathapana Bank, said “Sathapana Bank is honored and excited about this partnership with WBSV. This will provide more convenience and ease for both our customers to purchase residential units at WBSV, which is the first sports township project of its kind in Southeast Asia. With this partnership, we can support more home ownership in Cambodia.”",
      "Dr. Simon Vancliff, Chief Executive Officer of WB Sport Village Co., Ltd, said “We are also honored to cooperate with Sathapana Bank, which provides convenient residential loans to further facilitate our clients’ financial needs to own residential units within WBSV. WBSV is developed initially to host the participants of the Southeast Asian Games & 2023 ASEAN Para Games (SEA Games 2023) and then handed over to our clients. WBSV is conveniently located adjacent to the Morodok Techo National Sports Complex and within the rapidly developing northern part of Phnom Penh, which is the only development to combine luxurious living, vast sports facilities within a healthy and sustainable environment for our clients, with high quality construction and highly competitive pricing.”",
      "About WB Sport Village",
      "WB Sport Village Co., Ltd., a member of the WorldBridge Group, a developer with a strong background in the real estate industry for over 30 years. Located in the business zone, WorldBridge Sport Village has critically studied modern residential style with 12 condominiums equal to 1,319 rooms. One studio condominium corresponding to 163 rooms with 13 floors, shophouse, townhouse, row house, semi-detached villa, retail shopping malls, sports museum, spacious parking, perfect for future living and investment. Besides, WorldBridge Group, which has extensive experience in the modern high-rise buildings and luxury homes in Cambodia, will be committed to conveying new experiences and confidence to customers’ lives. Interestingly, it is accelerating construction that focuses on the quality of assembly, and convenient payment terms for customers is also part of the success of the WorldBridge Sport Village project.",
      "About Sathapana Bank",
      "Sathapana Bank is one of the leading commercial banks in Cambodia, with total assets of over US$ 2.1 billion and more than 4,000 employees. We have an extensive branch network nationwide with more than 170 branches, 3 Sathapana Premier banking halls, more than 230 ATMs with cash recycling capability. We provide full banking services such as loans, deposits, iBanking, Mobile Banking, debit & credit cards, domestic and foreign remittances, Western Union, trade finance, and other services. We are also offering tax collection services, public services payment with the Ministry of Public Works and Transportation, and various cooperation with mobile payment providers such as WING, Pi Pay, True Money, Ly Hour Veluy, eMoney, Bakong to give further convenience to our customers. Our partnership with Credit Bureau (Cambodia) Co., Ltd enables our customers to conveniently perform financial health check through Sathapana Mobile."
    ],
    "date": "June 21, 2021",
    "thumbnail": "../assets/images/news/wbsv-sathapana-bank-mou-signing-01.jpg",
    "images": [
      "wbsv-sathapana-bank-mou-signing-01.jpg",
      "wbsv-sathapana-bank-mou-signing-02.jpg",
      "wbsv-sathapana-bank-mou-signing-03.jpg"
    ]
  },
  {
    "titleId": "wbg020",
    "title": "Michelin Asia (Singapore) and WorldBridge Trading, donated 5.5 million masks to the Ministry of Health of the Kingdom of Cambodia",
    "des": [
      "At the Ministry of Health, in the morning of June 14, 2021, Michelin Asia (Singapore), also known as Michelin and WorldBridge Trading, donated 5.5 million masks to the Ministry of Health of the Kingdom of Cambodia to take part in preventing the spread of virus COVID-19 for the health and safety of the Cambodian people.",
      "The handover ceremony was presided over by His Excellency Dr Mam Bunheng, Minister of Health. It accompanied by Lok Chumteav Yok Sambath, Secretary of State of the Ministry of Health. Together with Neak Okhna Sear Rithy, Chairman of the Board of Directors of the WorldBridge Group and Lok Chumteav Eva NGUYEN BINH, Ambassador of France to Cambodia."
    ],
    "date": "June 21, 2021",
    "thumbnail": "../assets/images/news/michelin-asia-and-worldbridge-trading-donated-masks.jpg",
    "images": [
      "michelin-asia-and-worldbridge-trading-donated-masks-1.jpg",
      "michelin-asia-and-worldbridge-trading-donated-masks-2.jpg",
      "michelin-asia-and-worldbridge-trading-donated-masks-3.jpg",
      "michelin-asia-and-worldbridge-trading-donated-masks-4.jpg",
      "michelin-asia-and-worldbridge-trading-donated-masks-5.jpg",
      "michelin-asia-and-worldbridge-trading-donated-masks-6.jpg",
      "michelin-asia-and-worldbridge-trading-donated-masks-7.jpg",
      "michelin-asia-and-worldbridge-trading-donated-masks.jpg"
    ]
  },
  {
    "titleId": "wbg019",
    "title": "WorldBirdge Group distributed food & beverage consumable to some employees during the lockdown in the alert “Red Zone” restrictions",
    "des": [
      "During the lockdown of the COVID-19 pandemic, WorldBridge Group Of Companies has prepared food & beverage consumable for some employees who have been in the alert “Red Zone” restrictions or quarantine, each of them gets:",
      "- 50Kg rice bag",
      "- 3 packs of canned fish",
      "- 1 kg of dried fish",
      "- 3 cases of instant noodles",
      "- 3 tubes of vitamin C",
      "- 1 case of Coca-Cola",
      "All employees are the main assets of the company. Therefore, no matter what the circumstances, all employees of the WorldBridge Group are our family."
    ],
    "date": "April 21, 2021",
    "thumbnail": "../assets/images/news/wbg-distributed-food-beverage-some-employees-during-lockdown-9.jpg",
    "images": [
      "wbg-distributed-food-beverage-some-employees-during-lockdown-10.jpg",
      "wbg-distributed-food-beverage-some-employees-during-lockdown-7.jpg",
      "wbg-distributed-food-beverage-some-employees-during-lockdown-1.jpg",
      "wbg-distributed-food-beverage-some-employees-during-lockdown-2.jpg",
      "wbg-distributed-food-beverage-some-employees-during-lockdown-3.jpg",
      "wbg-distributed-food-beverage-some-employees-during-lockdown-4.jpg",
      "wbg-distributed-food-beverage-some-employees-during-lockdown-5.jpg",
      "wbg-distributed-food-beverage-some-employees-during-lockdown-6.jpg",
      "wbg-distributed-food-beverage-some-employees-during-lockdown-8.jpg",
      "wbg-distributed-food-beverage-some-employees-during-lockdown-9.jpg",
      "wbg-distributed-food-beverage-some-employees-during-lockdown-11.jpg",
      "wbg-distributed-food-beverage-some-employees-during-lockdown-12.jpg"
    ]
  },
  {
    "titleId": "wbg018",
    "title": "The first Cambodia WorldBridge Sport Village will soon appear in the development of Samdech Techo Hun Sen Dragon City",
    "des": [
      "The first large-scale commercial building and residential WorldBridge Sport Village will soon appear in Samdech Techo Hun Sen Dragon City, north of Phnom Penh.",
      "This innovative and unique WorldBridge Sport Village project will build for the 2023 Southeast Asian Nations and ASEAN Para Games, which will celebrate in Cambodia. The project developed with excellent architecture spanning more than 6 hectares next to the Morodok Techo National Stadium in Samdech Techno Hun Sen Dragon City, covering 35,000 hectares north of Phnom Penh’s newly developed area.",
      "The building stands out with its unique architecture combined with the most impressive aesthetics that project under-construction of WB Sport Village Co., Ltd., a member of the WorldBridge Group, a developer with a strong background in the real estate industry for over 30 years. Located in the business zone, WorldBridge Sport Village has critically studied modern residential style with 12 condominiums equal to 1,319 rooms. One studio condominium corresponding to 163 rooms with 13 floors. Business flats, twin villas, shopping malls, sports museums, spacious parking, perfect for future living and investment.",
      "Not only that, WorldBridge Sport Village has a well-connected infrastructure, surrounded by bridges, roads, lanes, public transport, hospitals, and international schools, gyms, 5-star golf courses and more. After the 2023 SEA Games, we believe that WorldBridge Sport Village will make it a beautiful and sports city modernization in the region. Located within the Morodok Techno National Stadium, it takes only 15 minutes from the business centre area due to the connection of existing infrastructure and the future expansion. It includes more than four bridges, old and new tangled roads, public transport, along a sky train project connecting to the commercial centre area. It is designed successful long-lasting, along with other facilities built for sports as well.",
      "Besides, WorldBridge Group, which has extensive experience in the modern high-rise buildings and luxury homes in Cambodia, will be committed to conveying new experiences and confidence to customers’ lives. Interestingly, it is accelerating construction that focuses on the quality of assembly, and convenient payment terms for customers is also part of the success of the WorldBridge Sport Village project. Especially in this first stage, customers can pay a deposit of only USD1,000 to become a homeowner!",
      "Please contact: The Bridge SOHO Sales Office, The Bridge Soho Tower #38-25, National Assembly Street, Village 14, Tonle Bassac, Chamkarmorn, Phnom Penh, Cambodia, please contact the sales team at 085 611 147 / 087 611 147"
    ],
    "date": "March 21, 2021",
    "thumbnail": "../assets/images/news/wbsv-sale-gallery-soft-launch-6.jpg",
    "images": [
      "wbsv-sale-gallery-soft-launch-1.jpg",
      "wbsv-sale-gallery-soft-launch-2.jpg",
      "wbsv-sale-gallery-soft-launch-3.jpg",
      "wbsv-sale-gallery-soft-launch-4.jpg",
      "wbsv-sale-gallery-soft-launch-5.jpg",
      "wbsv-sale-gallery-soft-launch-6.jpg",
      "wbsv-sale-gallery-soft-launch-7.jpg",
      "wbsv-sale-gallery-soft-launch-8.jpg",
      "wbsv-sale-gallery-soft-launch-9.jpg",
      "wbsv-sale-gallery-soft-launch-10.jpg",
      "wbsv-sale-gallery-soft-launch-11.jpg",
      "wbsv-sale-gallery-soft-launch-12.jpg",
      "wbsv-sale-gallery-soft-launch-13.jpg"
    ]
  },
  {
    "titleId": "wbg017",
    "title": "Neak Oknha Sear Rithy Donates USD200,000 to the Royal Government to Purchase Nokor Tep Hospital",
    "des": [
      "Neak Oknha Sear Rithy, Chairman of the Board of Directors of the WorldBridge Group, donated USD200,000 to the Royal Government of Cambodia to purchase Nokor Tep Hospital as a COVID-19 treatment centre.",
      "The donation made after Samdech Techno Hun Sen announced the purchase of Nokor Tep Hospital as state property. Then, it will be renamed Luang Mey Hospital in honour of Her Majesty the Queen Mother Norodom Monineath Sihanouk.",
      "We all have a role in preventing the spread of COVID-19 in our community by participating in the 3 Dos & 3 Don’ts and strictly following the health and safety guidelines of the Ministry of Health."
    ],
    "date": "March 04, 2021",
    "thumbnail": "../assets/images/news/neak-okhna-donation-purchase-nokor-tep-hospital.jpg",
    "images": []
  },
  {
    "titleId": "wbg016",
    "title": "MoU Signed on Cooperation Training Youth for Employment Opportunities Between the Union of Youth Federations of Cambodia and WorldBridge Group",
    "des": [
      "WorldBride Group family has organized a Lunar New Year celebration for its employees by distributing mandarin oranges as a traditional symbol of good fortune to each department group of companies with a smile and a pleasant. At the same time, WorldBridge Group family also prepared beautiful roses and chocolates for all the female staff for the upcoming Valentine’s Day."
    ],
    "date": "March 04, 2021",
    "thumbnail": "../assets/images/news/MoU-between-UYFC-WBG-5.jpg",
    "images": [
      "MoU-between-UYFC-WBG-1.jpg",
      "MoU-between-UYFC-WBG-2.jpg",
      "MoU-between-UYFC-WBG-3.jpg",
      "MoU-between-UYFC-WBG-4.jpg",
      "MoU-between-UYFC-WBG-5.jpg",
      "MoU-between-UYFC-WBG-6.jpg",
      "MoU-between-UYFC-WBG-7.jpg"
    ]
  },
  {
    "titleId": "wbg015",
    "title": "Lunar New Year 2021",
    "des": [
      "WorldBride Group family has organized a Lunar New Year celebration for its employees by distributing mandarin oranges as a traditional symbol of good fortune to each department group of companies with a smile and a pleasant. At the same time, WorldBridge Group family also prepared beautiful roses and chocolates for all the female staff for the upcoming Valentine’s Day."
    ],
    "date": "December 25, 2020",
    "thumbnail": "../assets/images/news/wbg-lunar-new-year-2021-11.jpg",
    "images": [
      "wbg-lunar-new-year-2021-1.jpg",
      "wbg-lunar-new-year-2021-2.jpg",
      "wbg-lunar-new-year-2021-3.jpg",
      "wbg-lunar-new-year-2021-4.jpg",
      "wbg-lunar-new-year-2021-5.jpg",
      "wbg-lunar-new-year-2021-6.jpg",
      "wbg-lunar-new-year-2021-7.jpg",
      "wbg-lunar-new-year-2021-8.jpg",
      "wbg-lunar-new-year-2021-9.jpg",
      "wbg-lunar-new-year-2021-10.jpg",
      "wbg-lunar-new-year-2021-11.jpg",
      "wbg-lunar-new-year-2021-12.jpg",
      "wbg-lunar-new-year-2021-13.jpg",
      "wbg-lunar-new-year-2021-14.jpg",
      "wbg-lunar-new-year-2021-15.jpg",
      "wbg-lunar-new-year-2021-16.jpg",
      "wbg-lunar-new-year-2021-17.jpg",
      "wbg-lunar-new-year-2021-18.jpg",
      "wbg-lunar-new-year-2021-19.jpg",
      "wbg-lunar-new-year-2021-20.jpg",
      "wbg-lunar-new-year-2021-21.jpg",
      "wbg-lunar-new-year-2021-22.jpg",
      "wbg-lunar-new-year-2021-23.jpg",
      "wbg-lunar-new-year-2021-24.jpg",
      "wbg-lunar-new-year-2021-25.jpg",
      "wbg-lunar-new-year-2021-26.jpg",
      "wbg-lunar-new-year-2021-27.jpg",
      "wbg-lunar-new-year-2021-28.jpg",
      "wbg-lunar-new-year-2021-29.jpg",
      "wbg-lunar-new-year-2021-30.jpg",
      "wbg-lunar-new-year-2021-31.jpg",
      "wbg-lunar-new-year-2021-32.jpg",
      "wbg-lunar-new-year-2021-33.jpg",
      "wbg-lunar-new-year-2021-34.jpg",
      "wbg-lunar-new-year-2021-34.jpg",
      "wbg-lunar-new-year-2021-35.jpg",
      "wbg-lunar-new-year-2021-36.jpg",
      "wbg-lunar-new-year-2021-37.jpg"
    ]
  },
  {
    "titleId": "wbg014",
    "title": "Christmas Celebration 2020",
    "des": [
      "WorldBridge Group has organized a Christmas celebration this year with gifts from Santa Claus to all employees. Please have a look at all the beautiful pictures! In the meantime, please protect yourself and your loved ones from coronavirus",
      "Merry Christmas everyone!"
    ],
    "date": "December 25, 2020",
    "thumbnail": "../assets/images/news/worldbridge-group-christmas-celebration-2020-1.jpg",
    "images": [
      "worldbridge-group-christmas-2020-1.jpg",
      "worldbridge-group-christmas-2020-2.jpg",
      "worldbridge-group-christmas-2020-3.jpg",
      "worldbridge-group-christmas-2020-4.jpg",
      "worldbridge-group-christmas-celebration-2020-1.jpg",
      "worldbridge-group-christmas-2020-6.jpg",
      "worldbridge-group-christmas-2020-7.jpg",
      "worldbridge-group-christmas-2020-8.jpg",
      "worldbridge-group-christmas-2020-9.jpg",
      "worldbridge-group-christmas-2020-10.jpg",
      "worldbridge-group-christmas-2020-11.jpg",
      "worldbridge-group-christmas-2020-12.jpg",
      "worldbridge-group-christmas-2020-13.jpg",
      "worldbridge-group-christmas-2020-14.jpg",
      "worldbridge-group-christmas-2020-15.jpg",
      "worldbridge-group-christmas-2020-16.jpg",
      "worldbridge-group-christmas-2020-17.jpg",
      "worldbridge-group-christmas-2020-18.jpg",
      "worldbridge-group-christmas-2020-19.jpg",
      "worldbridge-group-christmas-2020-20.jpg",
      "worldbridge-group-christmas-2020-21.jpg",
      "worldbridge-group-christmas-2020-22.jpg",
      "worldbridge-group-christmas-2020-23.jpg"
    ]
  },
  {
    "titleId": "wbg013",
    "title": "WorldBridge i4.0 SME Cluster Construction Site is Now Officially Started",
    "des": [
      "Kandal: Groundbreaking Ceremony for the Construction of the “WorldBridge i4.0 SME Cluster” in the Kingdom of Cambodia through WorldBridge Industrial Developments held on November 27, 2020, is located in Koh Kor village, Roka Khpos commune, Takhmao city, Kandal province, after organizing an official visit on-site last September.",
      "The ceremony was presided over by His Excellency Dr. Cham Prasidh, Senior Minister, Minister of Industry, Science, Technology and Innovation, includes the significant local and international institutions such as UNIDO or FASMEC and key business community members will also be present at the event. The newest innovative industrial project launched in Cambodia is strategically located near the new future airport in Saang district, Kandal province, on the Third New Ring Road.",
      "WorldBridge Industrial Developments is a member of WorldBridge Group, which is developing another major project on the same site, the “Serey Mongkul Satellite City” affordable housing project has competed at 70%. Both projects highlight the commitment of the WorldBridge Group to support the Sustainable Development Goals (SDG) set by the United Nations.",
      "“WorldBridge i4.0 SME Cluster” is a unique project that is thought to help Cambodia to build its growth internally and allows SME to leapfrog from i2.0 to i4.0 environment and set the stage for new opportunities in the field of investment, manufacturing, SME development and entrepreneurship in Cambodia.",
      "His Excellency Senior Minister considered that the establishment of small and medium enterprise clusters is very significant because the collection of SMEs to do this is in line with the needs of the market if they lack capital, there is a source of finance. Banks to support SMEs, lending, business expansion, including training in accounting skills, accounting and energy efficiency training. When SMEs produce and need to ship their products to markets both domestically and internationally. The WorldBridge Group is a provider of shipping services and logistics communications that can provide a marketable product with all kinds of services to small and medium enterprises while investing in this collection area.",
      "Oknha Sear Rithy, Chairman of the Board of WorldBridge Group, said that the development project WorldBridge i4.0 SME Cluster is aimed at strengthening the management and promoting the competitiveness of the small and medium enterprise. Together with production processes, businesses and services in one place that are interconnected, supply and complement each other. He added that the company also works closely with development partners such as the United Nations Industrial Development Organization (UNIDO) and the United Nations Development Program (UNDP) to facilitate the establishment of a “Small and Medium Enterprise” on almost all sides.",
      "Oknha included that the key points that the company has provided services in this project are to benefit small and medium enterprises or entrepreneurs to understand the importance of establishing a complete production chain and reciprocal as an ecosystem in the WorldBridge i4.0 SME Cluster. He said that by formally investing in standardized services and reliable infrastructure for small and medium enterprises, the production chain enhances value, create resources, save time, and innovate production and quality cost-effective management.",
      "After the Royal Government agreed to provide a package of incentives to the WorldBridge Industrial Developments, the company also set up a small and medium enterprise cluster, which is 8-month and schedule to be completed at the end of 2021, which divided into 7-main parts, such as:",
      "1. Services Centers include Business Centers, One Window Service Office, Training Centers, Laboratories, Space for Restaurants and Beverages. Health check-ups and child care centers, conference centers, housing services and offices.",
      "2. The equipment support center industrial of SME with a total area of 1,097 square meters. It includes hot water supply, cold water, solar energy management system, office space, exhibition hall, logistics area, courtyard area, and outdoor spaces.",
      "3. Infrastructure with fuel and electric power supply, power management system, building management system, water supply, waste and waste management, industrial and wastewater treatment plant, wastewater treatment plant, cable TV service and 24-hour security service, full-day Weekly fire and emergency services, 24-hour backup power throughout the week there is a car charging station.",
      "4. Local logistics and delivery service centers provide customs clearance, import and export services, on-site customs service, inventory management, refrigeration services, value-added services upon receipt and export. Packing of goods consists of ships and modern trucks.",
      "5. Ease of doing business with research and evaluation center, on-site training center, event/function venue, meeting and conference halls, commercial and retail rental space, information services, eliminating all issuance of any advertisement that interferes with a legitimate business.",
      "6. Make it easier for workers to work by setting up cafeterias for workers, restaurants and cafes for workers’ day, labor market, charging stations, free motorbikes, public and private recreation areas, health centers in the workplace and housing for workers or room for rent.",
      "7. Provide other support services such as accounting services, human resources, marketing, information technology, etc. Provide pre-launch services, financial and loan consulting services, reporting and testing of workers. The cluster has a wastewater treatment plant on-site and provides recruitment services.",
      "For more information, please contact:",
      "Address: The Bridge Soho Tower #38-25 National Assembly Street, Village 14, Tonle Bassac Commune, Chamkarmorn District, Phnom Penh, Cambodia",
      "Email Address: info@wbid.com.kh",
      "Website: https://www.wbid.com.kh",
      "Telephone:+855 23 723 770"
    ],
    "date": "November 27, 2020",
    "thumbnail": "../assets/images/news/worldbridge-i4-0-sme-cluster-construction-site-officially-started-1.jpg",
    "images": [
      "worldbridge-i4-0-sme-cluster-construction-site-officially-started-1.jpg",
      "worldbridge-i4-0-sme-cluster-construction-site-officially-started-2.jpg",
      "worldbridge-i4-0-sme-cluster-construction-site-officially-started-3.jpg",
      "worldbridge-i4-0-sme-cluster-construction-site-officially-started-4.jpg",
      "worldbridge-i4-0-sme-cluster-construction-site-officially-started-5.jpg",
      "worldbridge-i4-0-sme-cluster-construction-site-officially-started-6.jpg",
      "worldbridge-i4-0-sme-cluster-construction-site-officially-started-7.jpg",
      "worldbridge-i4-0-sme-cluster-construction-site-officially-started-8.jpg",
      "worldbridge-i4-0-sme-cluster-construction-site-officially-started-9.jpg",
      "worldbridge-i4-0-sme-cluster-construction-site-officially-started-10.jpg",
      "worldbridge-i4-0-sme-cluster-construction-site-officially-started-11.jpg",
      "worldbridge-i4-0-sme-cluster-construction-site-officially-started-12.jpg",
      "worldbridge-i4-0-sme-cluster-construction-site-officially-started-13.jpg",
      "worldbridge-i4-0-sme-cluster-construction-site-officially-started-14.jpg",
      "worldbridge-i4-0-sme-cluster-construction-site-officially-started-15.jpg"
    ]
  },
  {
    "titleId": "wbg012",
    "title": "The Professional Tyre and Car Maintenance Service Centre “TYREPLUS” is Officially Going on Business Launches in Cambodia",
    "des": [
      "Phnom Penh – On Thursday, November 5, 2020, H.E. Sun Chanthol, Senior Minister of the Ministry of Public Works and Transport, presided over the inauguration ceremony of the professional tyre and car maintenance service centre “TYREPLUS” by WorldBridge Car Solutions with the participation of the Ambassador Of France to Cambodia, representatives of the company, and technical officers of the Ministry of Public Works and Transport along with a representative of relevant authorities and units.",
      "Speaking on the event, The Senior Minister emphasized that the opening of the “TYREPLUS” by WorldBridge Car Solutions is an utmost step in the public service reform campaign closer to the people and provide this service quickly, efficiently and transparently. The Senior Minister continued that the Ministry encourages the TYREPLUS to expand its vehicle maintenance services throughout 25 Cities/Provinces of Cambodia so that people can receive this service comfortably and also as a mechanism to prevent and reduce traffic accidents which are caused by vehicle factors.",
      "Mr. Tim Mitchell, Country Manager of Michelin Cambodia said: “Michelin is committed to providing both individual and company vehicle owners with the right tire safety for every customer”. A corporate partnership with WorldBridge Car Solutions Co., Ltd. aided to bring the professional tyre and car maintenance service centre “TYREPLUS” into Cambodia. All mechanics are trained to a standard and they will be assessed regularly to ensure that all mechanics provide consistent and quality service at all times. Currently, Cambodian consumers have a new option when looking for reliable car and tire care services.",
      "Okhna Sear Rithy, Chairman of the Board of WorldBridge Car Solutions Co., Ltd said: “By expanding additional TYRE PLUS Centre in Cambodia, we aim to enhance the reputation of the car care industry the use of modern technology and adherence to international standards. Customers who own individual cars and companies can visit the TYRE PLUS Centre for detailed reports on issues and troubleshooting services they pay for.”",
      "Innovation and growth",
      "The opening of TYREPLUS Centre will offer mid-range and affordable luxury car maintenance services, including tire replacement services, tire and repair service, tire alignment, battery replacement, auto repair services, engine oil change, brakes, stability control, pumping, air conditioning, and the Automotive Ignition System (AIS), a technology from Japan.",
      "As part of plans to expand its business to meet the ever-growing needs of the automotive market, TYRE PLUS is looking at additional locations to bring more convenience to customers across the country. Okhna Sear Rithy said, “Currently, car maintenance services are in a strong market and have a high potential for growth in Cambodia. With the growing number of investors in the business, WorldBridge Car Solutions will also offer investors the opportunity to own a TYRE PLUS centre through its franchise licensing program. These services include world-class training, store decoration, both hardware and software, sales consulting, and marketing that allows investors to own a business without the need for car maintenance experience before.”",
      "More info please contact:",
      "Facebook: TYREPLUS Cambodia",
      "Website: https://www.tyreplus.com",
      "TYRE PLUS has two locations in Chamkarmon district and Chak Angre Krom commune:",
      "Location: TYREPLUS BOKOR Address: #18, Street 93, corner of Street 245, Sangkat Tonle Bassac, Khan Chamkarmon, Phnom Penh, Cambodia. Phone Number: 023 866 646 Hours: 9:00 AM – 7:00 PM",
      "Location: TYREPLUS CHAK ANGRE Address: # 694, National Road 2, Sangkat Chak Angre Krom, Khan Meanchey, Phnom Penh Cambodia Phone Number: 023 866 645 Hours: 9:00 AM – 7:00 PM"
    ],
    "date": "November 05, 2020",
    "thumbnail": "../assets/images/news/TYPEPLUS-grand-opening.jpg",
    "images": [
      "typeplus-grand-opening-1.jpg",
      "typeplus-grand-opening-2.jpg",
      "typeplus-grand-opening-3.jpg",
      "typeplus-grand-opening-4.jpg",
      "typeplus-grand-opening-5.jpg",
      "typeplus-grand-opening-6.jpg",
      "typeplus-grand-opening-7.jpg",
      "typeplus-grand-opening-8.jpg",
      "typeplus-grand-opening-9.jpg",
      "typeplus-grand-opening-10.jpg",
      "typeplus-grand-opening-11.jpg",
      "TYPEPLUS-grand-opening.jpg",
      "typeplus-grand-opening-13.jpg"
    ]
  },
  {
    "titleId": "wbg011",
    "title": "The Mooncake Festival: A Mid-Autumn Celebration with a WorldBridge Group Family!",
    "des": [
      "On the afternoon of October 01, 2020, the WorldBridge Group family come together to have a delicious moon cake in a happy atmosphere of solidarity that presided over by Mr. Sear Daniel, Executive Director of WorldBridge Group."
    ],
    "date": "October 01, 2020",
    "thumbnail": "../assets/images/news/wbg-moon-cake-event-2020-1.jpg",
    "images": [
      "wbg-moon-cake-event-2020-1.jpg",
      "wbg-moon-cake-event-2020-2.jpg",
      "wbg-moon-cake-event-2020-3.jpg",
      "wbg-moon-cake-event-2020-4.jpg",
      "wbg-moon-cake-event-2020-5.jpg",
      "wbg-moon-cake-event-2020-6.jpg",
      "wbg-moon-cake-event-2020-7.jpg",
      "wbg-moon-cake-event-2020-8.jpg",
      "wbg-moon-cake-event-2020-9.jpg",
      "wbg-moon-cake-event-2020-10.jpg",
      "wbg-moon-cake-event-2020-11.jpg",
      "wbg-moon-cake-event-2020-12.jpg",
      "wbg-moon-cake-event-2020-13.jpg",
      "wbg-moon-cake-event-2020-14.jpg",
      "wbg-moon-cake-event-2020-15.jpg",
      "wbg-moon-cake-event-2020-16.jpg",
      "wbg-moon-cake-event-2020-17.jpg"
    ]
  },
  {
    "titleId": "wbg010",
    "title": "Singapore Medical Center (Cambodia) Embarks on Employee’s Health Benefit Journey with Ly Hour Group",
    "des": [
      "Phnom Penh – On September 29, 2020, a ceremony to mark the signing of a Memorandum of Understanding (MoU) between Singapore Medical Center (Cambodia), a high representative of Okhna Sear Rithy and Ly Hour Group, a high representative of Okhna Ly Hour on collaboration to effectuate Ly Hour Group employees’ health screening program which is curated to provide a general health status of oneself.",
      "This is one of the many efforts expended by Ly Hour Group to reward their staff and attract talent in the competitive manpower market in Cambodia. Singapore Medical Center (Cambodia) was born of a desire to deliver Singapore standards of medical excellence to the people of Cambodia. SGMC offers a suite of comprehensive and health care services encompassing of general practice, specialist care, health screening, diagnostic imaging, women’s health, and general surgery. It is conveniently located at The Bridge Retail Mall Level 3A, in the vicinity of Aeon Mall 1 and The Australia Embassy.",
      "Besides providing healthcare services, SGMC strongly believes that it is also crucial to heighten health awareness among the companies and the people of Cambodia. Prevention and healthy lifestyle is the first and basic step to good health."
    ],
    "date": "September 29, 2020",
    "thumbnail": "../assets/images/news/mou-between-singapore-medical-center-lyhour-group.jpg",
    "images": [
      "MoU_SGMC_LyHour-1.jpg",
      "MoU_SGMC_LyHour-2.jpg",
      "MoU_SGMC_LyHour-3.jpg",
      "MoU_SGMC_LyHour-4.jpg",
      "MoU_SGMC_LyHour-5.jpg",
      "mou-between-singapore-medical-center-lyhour-group.jpg",
      "MoU_SGMC_LyHour-7.jpg",
      "MoU_SGMC_LyHour-8.jpg",
      "MoU_SGMC_LyHour-9.jpg",
      "MoU_SGMC_LyHour-10.jpg",
      "MoU_SGMC_LyHour-11.jpg",
      "MoU_SGMC_LyHour-12.jpg",
      "MoU_SGMC_LyHour-13.jpg",
      "MoU_SGMC_LyHour-14.jpg",
      "MoU_SGMC_LyHour-15.jpg",
      "MoU_SGMC_LyHour-16.jpg"
    ]
  },
  {
    "titleId": "wbg009",
    "title": "The SME Cluster Project is Seen as an Innovative and Strategic Solution for SME and Industrial Development in Cambodia.",
    "des": [
      "On Wednesday 9th September, H.E. Mean Sophea, Secretary of State and high representative of H.E. Kitti Setha Bandit Cham Prasidh, Senior Minister and Minister of the Ministry of Industry, Science, Technology and Innovation (MISTI) visited the site for the first SME Cluster planned by WorldBridge Industrial Developments (WBID). Located in the Takhmao Town of Kandal Province opposite affordable housing project and near the planned Phnom Penh International Airport and Ring Road 3, the SME Cluster Project is seen as an innovative and strategic solution for SME and industrial development in Cambodia.",
      "Heightened by the ongoing Covid-19 situation and retraction of its EBA trade status, now more than ever Cambodia needs to accelerate its implementation of industrial diversification and SME development strategies to enable self-reliance and to sustain its economic growth. Designed for this purpose, the SME Cluster is thought to be an effective means in achieving these objectives and the goals of the RGC’s Rectangular Strategy. Its unique i4.0 based Ecosystem will elevate Cambodia’s manufacturing capabilities and thinking enabling it to leapfrog from today’s i2.0 environment to tomorrow’s global, i4.0 based environment. By enabling this environment, Cambodia will be able to retrain and better utilize its large and young workforce, integrate its talented ICT sector and set the stage for entrepreneurship in new product development using it ICT, agricultural and natural resources.",
      "Differing from SEZs, Industrial Parks or traditional SME Clusters found today, the i4.0 SME Cluster is an innovative solution which supports the IDP objectives and serves as a vehicle in which RGC policies supporting skills-based employment, SME development, agro processing expansion and industrial diversification can be easily achieved. And most importantly, it brings a new future for SMEs, Entrepreneurs, ICT sector & manufacturing Investment in the Kingdom by bringing them together into complete and “co-opetitive” value chains.",
      "Charles Esterhoy, CEO of WorldBridge Industrial Developments, founder and creator of the project understood that the solution needed to bridge the gaps between manufacturing FDI & local SMEs was to create and locate complete value chains inside of a flexible and responsive Ecosystem of facilities, services and ICT platforms. Using 4.0 technologies and integrating Active Management techniques, these value chains and their ecosystems can be linked together to enable the production of higher value outputs for both domestic and overseas markets. The construction of this first cluster will start in October 2020 and is planned to open in April 2021.",
      "Oknha Sear Rithy, Chairman of the WorldBridge Group, noted there are natural social and economic synergies between the affordable housing and SME Cluster Projects which will bring a higher value proposition to residents, SME manufacturers and investors in the area. That is, the facilities and amenities provided by both projects will serve and add value to one another while at the same time maximizing land use and enhance the overall architectural outlook of the whole areas. For instance, the SME Cluster will KINGDOM OF CAMBODIA NATION RELIGION KING 8 not only create employment and business opportunities for people living on our housing estate next door, but it also acts as a jobs training and skill development center that can benefit the whole community. Similarly, the residential and commercial area as well as the landscape parks and other public amenities of the housing estate will serve its own residents as well as workers and staff within SME cluster."
    ],
    "date": "September 09, 2020",
    "thumbnail": "../assets/images/news/WBID-sme-cluster-event-09-09-2020-11.jpg",
    "images": [
      "WBID-sme-cluster-event-09-09-2020-1.jpg",
      "WBID-sme-cluster-event-09-09-2020-2.jpg",
      "WBID-sme-cluster-event-09-09-2020-3.jpg",
      "WBID-sme-cluster-event-09-09-2020-4.jpg",
      "WBID-sme-cluster-event-09-09-2020-5.jpg",
      "WBID-sme-cluster-event-09-09-2020-6.jpg",
      "WBID-sme-cluster-event-09-09-2020-7.jpg",
      "WBID-sme-cluster-event-09-09-2020-8.jpg",
      "WBID-sme-cluster-event-09-09-2020-9.jpg",
      "WBID-sme-cluster-event-09-09-2020-10.jpg",
      "WBID-sme-cluster-event-09-09-2020-11.jpg",
      "WBID-sme-cluster-event-09-09-2020-12.jpg",
      "WBID-sme-cluster-event-09-09-2020-13.jpg",
      "WBID-sme-cluster-event-09-09-2020-14.jpg",
      "WBID-sme-cluster-event-09-09-2020-15.jpg",
      "WBID-sme-cluster-event-09-09-2020-16.jpg"
    ]
  },
  {
    "titleId": "wbg008",
    "title": "Affordable Housing Project in Kandal Nearing Completion",
    "des": [
      "Worldbridge Homes Co Ltd’s $73 million affordable housing project in Kandal province’s Koh Kor village, in Sa’ang district, is on track to be completed at year’s end or at the beginning of next year, its general manager Yuk Sothirith told The Post on Wednesday.",
      "The project broke ground early in 2017 and is being built on 23ha.",
      "WorldBridge Homes is a subsidiary of WorldBridge Group, whose major projects in Phnom Penh include The Bridge and The Peak buildings.",
      "The price of the housing units in the project with dimensions 4mx7m range from $25,000 to nearly $30,000.",
      "Sothirith said construction is currently 90 per cent complete, with Phase I – comprising 603 homes – scheduled to be completed before Khmer New Year in mid-April.",
      "“As planned, the company will deliver the first phase of homes [to their new owners] early in April as construction is 100 per cent complete. All that remains is to connect water and electricity,” he said.",
      "He said the project is divided into two phases, the second of which is 30 per cent complete.",
      "During a visit to the project site on Monday, Minister of Land Management, Urban Planning and Construction Chea Sophara said the government encourages the private sector to invest in affordable housing projects, to provide suitable living spaces for the people.",
      "“This is a joint effort between the company and the government to meet the needs of low and middle-income residents for affordable housing,” he said.",
      "Keller Williams Sen Sok regional operation principal Sam Soknoeun said the increase in the number of people living and working in Phnom Penh has led to higher demand for housing, especially affordable ones.",
      "Affordable housing projects will find quick success if the site is not too far from the city centre, which is home to schools, workplaces, hospitals, commercial centres and more diverse services, he said.",
      "“WorldBridge Homes’ development is going well, but sales may not be as quick as it is a bit far from Phnom Penh and not open to the public,” he said.",
      "Due to the city centre’s high land prices, affordable housing is mainly limited to the low-cost condominium project Arakawa Residence in Sen Sok district’s Teuk Thla village.",
      "WorldBridge has sold 1,088, or 44 per cent of the project’s total 2,457 houses. More than 23 per cent of the buyers are civil servants, the ministry said in a press release on Monday.",
      "Cambodia has five affordable housing projects – two in the capital, two in Kandal province and one in Banteay Meanchey province – comprising 8,331 landed units and 7,256 strata units, it said.",
      "The ministry defines affordable housing units as those priced less than $30,000.",
      "Source: Phnom Penh Post"
    ],
    "date": "February 19, 2020",
    "thumbnail": "../assets/images/news/worldbridge_homes_affordable_housing_project_in_kandal.jpg",
    "images": []
  },
  {
    "titleId": "wbg007",
    "title": "First Phase of Affordable Housing to be Completed Within The Year",
    "des": [
      "The first affordable housing project targeting lower- and middle-income families will be completed by the end of this year, according to senior staff from WorldBridge Homes Co, the company behind the project.",
      "Serey Mongkul Satellite City on the outskirts of Phnom Penh now has 603 completed homes in its first phase with a further 2,457 houses still to be built, said Yuk Sothirith, general manager at Worldbridge Homes Co.",
      "He said that the first affordable housing project was built on approximately 23 hectares of land at a total investment of approximately $73 million. Yuk said that the handover ceremony for the first phase will be conducted before Khmer New Year in April this year.",
      "He said the second phase is currently 30 percent complete and added that the general infrastructure, sewerage system, water supply, electricity and road have already been installed.",
      "Yuk also said that among the 603 houses, more than 80 percent have already been sold, with almost half the remaining 1,854 under construction sold too.",
      "“We will hand over the houses phase by phase. Once we complete 500 to 600 houses, we will hand them over to the customers,” said Yuk. “We have planned for the whole project to be completed by the end of this year, or early 2021 at the latest,” he added.",
      "“So far, more than 30 percent of our customers are civil servants, but this figure will most likely change from month to month,” Yuk said.",
      "He added that because this is the first affordable home project in Cambodia, the company has defined the quality and standard, so the next developers can use this model with the company seeking to provide more value to its customers.",
      "The project will include parks and gardens, green spaces, markets, schools, a hospital, possibly a public bus station in the project area and will reserve land for a small business cluster.",
      "Deputy Prime Minister and Minister of Land Management, Urban Planning, and Constructon Chea Sophara said this week that this is the first project of its kind in Cambodia.",
      "He said the government will be assisting with infrastructure such as roads to the project, water and electricity.",
      "“This project will help civil servants, retired officials, workers, newly-weds and newcomers, all who are low-income people that need good housing,” he added.",
      "In 2017, the affordable housing policy was drawn up by the government aimed at improving the lives of low- and middle-income earners by encouraging developers to shift their focus to low-cost housing developments.",
      "The policy provides incentives for developers such as tax breaks and reduced red tape including approvals for construction permits and business licences, while it also allows for special rates of income tax, property tax and value-added tax. To enjoy these incentives, however, projects must comprise 100 low-cost housing units priced between $15,000 and $30,000. The projects must also be within 20 kilometres of Phnom Penh city and must feature green spaces. Developers must also cooperate with financial institutions to create credit schemes with low-interest rates to enhance the project’s affordability.",
      "Currently, there are five projects with a construction permit from the ministry. Two are located in Phnom Penh, two in Kandal province and one in Poipet’s Banteay Meanchey provincial city, all with a combined 8,331 houses and units.",
      "Source: Khmer Times"
    ],
    "date": "February 19, 2020",
    "thumbnail": "../assets/images/news/affordable-housing-to-be-completed-within-the-year.jpg",
    "images": []
  },
  {
    "titleId": "wbg006",
    "title": "Muuve and Ooctane Put Partnership in Motion",
    "des": [
      "Cambodian food delivery start-up Muuve has announced a partnership with Sear Rithy’s investment company Ooctane, a local venture capital firm, to meet market demands.",
      "Muuve CEO Panh Phanith issued a press release on Tuesday saying his company seeks to provide consumers with a new type of food delivery service in the Kingdom.",
      "“We value customer service and offer convenient features in our app such as the ability to pinpoint on a map where you would like your food delivered.",
      "“In a city like Phnom Penh where addresses are hard to find, we have noticed that consumers really appreciate small details like this,” he said.",
      "Muuve was founded in 2018 by Cambodian entrepreneurs who themselves have quickly become role models in the country’s growing technology start-up scene.",
      "Sear Rithy, chairman of the WorldBridge Group, a Phnom Penh-based logistics service provider, said Muuve’s attention to customer service, its variety of food options and talented team is what sets them apart.",
      "“We are very excited to welcome Muuve into the WorldBridge Group family and our resources and network will be there to assist them,” Rithy said.",
      "Muuve business development head Vathanak Choun said: “What sets us apart from other delivery services is the fact that we offer more freedom to our Muuvers along with the opportunity for them to earn extra income by getting jobs in addition to what they do on a daily basis.”",
      "“We can also look into helping Muuvers find vehicles if they don’t have one already as long as they show interest in being part of our Muuver family,” Vathanak said.",
      "Muuve is a food ordering and delivery service platform that supports local businesses through advanced applications to ease the busy lifestyles of today, the press release said.",
      "Muuve was awarded “Best Tech Startup Of The Year 2019” by the Ministry of Posts and Telecommunications.",
      "Tan Allen, founder of Al’s Tacos restaurant, noted that using food delivery platforms can sometimes be tricky because if anything goes wrong, customers tend to blame the restaurants, but Muuve has been great in helping keep his customers happy.",
      "“My restaurant uses Muuve. I have been impressed with the way Muuvers treat my staff. They come on time and deliver to my customers on time as well,” he said.",
      "Source: Phnom Penh Post"
    ],
    "date": "February 18, 2020",
    "thumbnail": "../assets/images/news/award_winning_tech_start-up_muuve_completes_partnership_with_investment_company_ooctane._supplied.jpg",
    "images": []
  },
  {
    "titleId": "wbg005",
    "title": "WorldBridge, SHE-CAN Team Up",
    "des": [
      "The WorldBridge Group and US-based NGO Supporting Her Education Changes a Nation (SHE-CAN) yesterday signed a memorandum of understanding to develop Cambodia’s human capital by investing in the education, training, and promotion of female leaders.",
      "The MoU establishes a framework of collaboration between SHE-CAN and WorldBridge that will expand access to internships and employment opportunities for women in Cambodia, giving WorldBridge access to high-quality candidates.",
      "The agreement will help identify employment and internship opportunities in Cambodia, improve communication between SHE-CAN candidates and Cambodian organisations when it comes to internship and employment opportunities, and ensure highly-qualified candidates are considered for opportunities at WorldBridge.",
      "Sear Rithy, chairman of the WorldBridge Group, said that working with SHE-CAN gives his company access to talented women that return to Cambodia after graduating from a university in the US.",
      "“We will provide internship and employment opportunities to them so that they can earn valuable work experience with our business leaders and experts. More importantly, they could become our next employees. This programme can prepare them for the demands of today’s workforce and future market growth in Cambodia,” said Mr Rithy.",
      "Barbara Bylenga, founder and executive director of SHE-CAN, said her organisation builds females leaders and prepares them to improve their nations and the opportunities available to women.",
      "Ms Bylenga added that SHE-CAN selects low-income women with high leadership potential and help them earn a college degree in the US, as well as transition into impactful leaders at home through partnerships such as this.",
      "She added that since 2011, SHE-CAN has helped 56 women, 19 of them from Cambodia, win scholarships in the US.",
      "She said her organisation accepts about 10 Cambodian scholars a year, and that their goal is to launch at least 63 Cambodian women on a leadership path by 2023.",
      "“To accomplish this we have partnerships with 15 top US colleges who agree to provide tuition, room, and board for our scholars. Importantly, SHE-CAN and her mentors link the scholars not just to jobs, but to world-class career building opportunities. That is why WorldBridge is the perfect partner for us,” she said.",
      "“Through WorldBridge we are able to offer our scholars valuable experiences that will foster their career and leadership potential and help them grow into impactful leaders. And in doing this, they become role models who will inspire millions of young women who never knew they too could grow into leaders in Cambodia,” she added.",
      "Source: Khmer Times"
    ],
    "date": "April 23, 2019",
    "thumbnail": "../assets/images/news/chairman-of-the-WorldBridge-Group.jpg",
    "images": []
  },
  {
    "titleId": "wbg004",
    "title": "From Shipwreck to Fintech: One Entrepreneur’s Journey From Refugee To Business Mogul",
    "des": [
      "Cambodia can be a hard sell, but Rithy Sear relishes the challenge. When he courts potential business partners from overseas, he listens to their worries about the small size of the market, the flourishing trade in smuggled goods, the corruption. And once they’re done, he begins working tirelessly to reshape their opinions.",
      "Sear’s negotiating advantages are preparation and confidence. He usually doesn’t meet investors in his office. That’s a cluttered, temporary suite in the Phnom Penh headquarters of his WorldBridge International, his logistics, property and investment company. Instead, he chooses the exclusive business lounge on the 12th floor of the Sofitel Hotel, where the floor-to-ceiling windows lead your eyes to The Bridge, his gleaming 45-story hotel, retail and condominium complex that will be completed by the end of the year. That’s where he’ll present his argument.",
      "Global security company Brink’s got this treatment. It already was a customer of Sear’s logistics company, transporting Tiffany & Co. jewelry to Cambodia. But Sear figured that Brink’s could increase its local revenue eightfold if it worked with WorldBridge on offering more services in the country. When it hesitated, the hard-charging entrepreneur says he began a full-court press, flying to any Southeast Asian country that a Brink’s executive happened to be visiting until it signed a joint-venture agreement in July.",
      "Ever since Cambodia reopened to the outside world in the 1990s, Sear, 48, has built his businesses by seeing what the rest of the region was doing and then making connections with multinational players. He fashions himself as a gateway to the country–a “clean and clear” local partner easing foreign investors into a largely wide-open emerging market while coaxing the government into removing barriers to economic development. Partners in the region “trust me; my credibility is very important,” he explains. “I never do a business trade in which anyone loses.”",
      "Forging The Path Into Cambodia",
      "Singapore, in particular, has been an inspiration for Sear, and Singapore property-development group Oxley Holdings his biggest partner. The Oxley WorldBridge joint venture is building The Bridge and has already sold all of its condos. That persuaded Oxley’s executive chairman and chief executive, Ching Chiat Kwong, to commit to building two more Phnom Penh projects. Next is The Peak, a $580 million complex of three 55-story towers that includes a 300-room Shangri-La hotel expected to be finished in 2020, and then The Palms, a $100 million luxury riverside community. Homes will start at $350,000, and this in a country where per capita gross national income is just above $1,000 a year.",
      "At the Oxley WorldBridge showroom in central Phnom Penh, Sear seems to concede that he had to hire foreign design and construction firms because local companies aren’t yet able to build 45- and 55-story towers. But he lauds the designs as his own ideas, declaring that the silver and gold skyscrapers of The Bridge and The Peak could blend into Singapore’s skyline. For his part, Ching says he was surprised by the young, bustling population of Phnom Penh. He quickly signed on after meeting Sear, and now calls Cambodia one of his best-performing overseas investments.",
      "The glitzy real estate developments grab lots of attention, but the foundation of WorldBridge is the logistics company, which Sear started as a delivery service in the 1990s and then expanded into import/export and outsourcing services. It boasts 3,750 employees, including some in Vietnam, Laos, Thailand and Myanmar, and lists more than 200 multinational customers.",
      "Sear says he’s a billionaire, and that well may be, but Forbes Asia cannot verify this. He bases that claim largely on the value of the 7.5 million square meters of land around the country that he says he’s purchased over more than two decades, but he declines to provide property records. He also says he owns 100% of privately held WorldBridge, along with a 50% stake in Oxley WorldBridge and 40% of Kerry WorldBridge Logistics, a joint venture with Hong Kong’s Kerry Logistics Network that provides logistics, freight forwarding and supply-chain support. He says his companies and joint ventures generated $1.3 billion in revenue last year, with the property business accounting for 60% of that. But he declines to provide net-profit figures and other financial results.",
      "Corruption is seen as endemic in Cambodia–the country ranks near the bottom of the 180 countries on Transparency International’s Corruption Perception Index–and it sours foreign investors’ stomachs even faster than prahok, the country’s traditional fermented fish. But Sear says he doesn’t pay bribes to customs officers to move cargo or hide a shipment’s contents, and customs officials and observers agree that he’s clean. He instills confidence in customers by complying with the government’s Best Traders Scheme, which promotes clean, prompt and inexpensive transfers of cargo at the borders. He is an oknha, a title given to anyone who’s donated at least $500,000 to the government for public projects. It gives him access to Prime Minister Hun Sen, but he says he advises on entrepreneurial matters rather than lobby for particular policies. Cambodian tycoons often benefit from ties to the prime minister and his family, but there’s no evidence that Sear’s businesses have received any special favors.",
      "Sear didn’t become rich and successful without having an eye for a deal. When French antique dealer Beatrix Dayde Latham left Cambodia and a home filled with Ming Dynasty antiques, Sear bought it and all the antiques for just $2.65 million on the promise he’d preserve the lavish custom construction. But he doesn’t stay in the museumlike villa because its southern-facing construction violates the principles of feng shui. He visits the property only to host and impress ambassadors, or fish from its prime location along the Mekong River.",
      "Translating Amid Turmoil",
      "Few tycoons grew up poorer or suffered more adversity than Sear. Born into a Chinese Khmer family in Phnom Penh, the third of five children, his family was forced to abandon their home and their auto-mechanic business in 1975 under the Khmer Rouge. They ended up in the regime’s work camps, where families were made to grow rice. His mother’s role as a cook in the camps allowed her to save morsels for her family, wrapped and submerged in the water tanks she carried at the end of the day.",
      "Despite the cadres’ slaughter of ethnic-Chinese citizens, everyone in Sear’s family survived, but the hardships did not end with the regime’s fall in 1978. With a gift for learning languages, Sear furtively picked up English from a Russian embassy worker, which was illegal under the country’s then-Vietnamese control. But the skill was highly valued as the U.S. and UN began slipping support into Cambodia, so in 1988 his mother arranged his passage on a refugee boat to Australia so he could offer his services as a translator and seek aid.",
      "The night before sailing, another ship, carrying 300 refugees, sank not far from Sihanoukville. As Sear’s cramped fishing boat set out, with his uncle steering, dozens of bodies still bobbed in the waves, he remembers. Weeks later his boat also sank, crashing into a reef near Sumatra. Clinging to a wood plank, he floated for three or four hours until Indonesian authorities arrived, saving and then dumping the 171 surviving refugees in a fishing village in Kalimantan. His six months there still haunt him, but he recalls the small wonders he found during the ordeal, among them the coconut candies brought by missionaries from China and the large, lucid eyes of the mermaid he swears he saw. The refugees were eventually shuttled off to a UN camp in the Riau Islands, and he translated for the UN for three years before being offered passage back to his family in Phnom Penh.",
      "At his riverside villa today, over bottles of Acqua Panna imported from Italy by his Auskhmer Import & Export, he looks back on his refugee voyage and explains how to survive on seawater: Mix one part toothpaste with two parts seawater and wait half an hour for the salt to settle at the bottom. This tonic will loosen the bowels, but after a leak in the supply of fresh water onboard, he says, it was better than nothing.",
      "From Survival To Thriving'",
      "After the country’s first election under the Transitional Authority in Cambodia in 1992, Sear leveraged his UN connections to make deliveries for embassies and aid agencies. He and his partners didn’t have a truck, so they’d spend $200 of the $800 to $1,000 they charged to rent a vehicle. Sometimes they had to dodge rocket-propelled grenade fire and unexploded ordnance. When Circle Freight International pulled out of Cambodia in 1993, he says, it left him its remaining assets–a table, two typewriters and an empty balance sheet. But he was able to use its connections to build his business. With ration deliveries bringing him to the Thai border, he forged a friendship with the secretary of the chairman of Thailand’s CTI Logistics, who later led him to a future partner, Kledchai Benjaathonsirikul of Kerry Express (Thailand).",
      "Sear’s profits grew, but he didn’t trust the local banks, so he parked his earnings in land. He started buying land along Phnom Penh’s Russian Federation Boulevard, which connected the city with the airport, because he saw developments springing up between other Southeast Asian cities and their airports. Land in a conflict zone was cheap, going for as little as 10 cents a square meter, so he bought a hectare or two each month. “I thought that since the UN spent $2 billion to make this country peaceful, it won’t let Cambodia go back to that type of serious civil war again,” he says.",
      "Sear has been able to use his valuable land in Phnom Penh and six provinces to entice some of his foreign partners into joint ventures. The first two Oxley WorldBridge projects are rising on high-priced land in Phnom Penh’s emerging business district, the Tonle Bassac neighborhood. The Kerry joint venture is developing a special economic zone on Sear’s land along National Road 2 and is using tax breaks to attract foreign investors to develop light manufacturing. This month he’s opening SME Eco Park, where WorldBridge will offer small and medium-size enterprises space and services to build their businesses. And his WorldBridge Homes is jumping into the affordable-housing market, selling 2,457 houses starting at $25,000 in a development that’s expected to be completed in 2020.",
      "Navigating The Shifts In Cambodia’s Economy",
      "Even with his Best Trader status and his oknha title, the bureaucracy can still stymie Sear. When Cambodian entrepreneurs rushed into e-commerce in 2015, WorldBridge Commerce launched an online shopping platform, My All In One Mall. In a partnership with Kerry Express, Sear pumped $17 million into the state-owned Cambodia Post to improve deliveries, hoping this would help his new business. But WorldBridge has suspended the platform until the government signs a long-awaited e-commerce law that would determine how to tax small orders by individuals.",
      "If Sear is frustrated with the government’s sluggish response to e-commerce and other innovations, he shrugs it off. For fast-paced advances he’s optimistically looking to the technology-savvy college students working for his business-process-outsourcing company, or his 21-year-old son, who runs an online shop selling his dad’s imports. (Sear also has a daughter, 17, who is studying to work in the tourism and hotel-management industries.)",
      "Excited by the venture-capital boom in Southeast Asia, Sear launched his own fund, Ooctane, in July. He hasn’t decided on a direction for the fund beyond assisting early-stage ideas, though he has mentioned a preference for fintech investments. But the money is there: He committed $5 million and won’t seek stakes in the startups until they prove viable, and he drummed up an additional $45 million from seven other investors.",
      "Education and technical training in Cambodia may not be at the level of its neighbors’, but Sear says he’s eager to push any young person with a big idea. He makes a similar argument to the entrepreneurs who question whether an advanced logistics network can accelerate the development of a small market such as Cambodia. “If we lead companies across Cambodia, from Vietnam to Thailand and Thailand to Vietnam, what do we get? Job creation,” he explains. “Cambodia is in the center of two big countries, so we have to know how to gain benefits from them.”",
      "Source: Forbes"
    ],
    "date": "October 03, 2018",
    "thumbnail": "../assets/images/news/rithy-sears-one-entrepreneurs-journey-from-refugee-to-business-mogul.jpg",
    "images": []
  },
  {
    "titleId": "wbg003",
    "title": "WorldBridge, UNDP and UNIDO Ink MoU to Bolster Development Efforts",
    "des": [
      "Worldbridge International, the United Nations Development Program (UNDP) and the United Nations Industrial Development Organisation (Unido) on Friday signed a memorandum of understanding (MoU) for three projects based on affordable housing, green logistics and connectivity for small- and medium-sized enterprises (SMEs).",
      "Through the MoU, UNDP will provide support for advancements in solar power, waste management, public transportation, driver training, road safety, and market education for entrepreneurs.",
      "Of these projects, Unido will provide support for those involving SMEs, according to Worldbridge general manager Sothirith Yuk.",
      "2030 development goals",
      "Worldbridge chairman Sear Rithy said the MoU will contribute significantly to improving the quality of life in the Kingdom by introducing affordable and comfortable living spaces as well as safe transportation systems and new business techniques.",
      "“The development and growth of Cambodia’s economy must be sustainable and provide a positive impact on society,” he said.",
      "UNDP country director for Cambodia Nick Beresford said the agreement is a reflection of a public-private partnership to drive sustainable investments in key areas that have an influence on society and the economy.",
      "“This partnership is an important step to achieve sustainable development goals by 2030,” he said.",
      "SMEs in Cambodia often face problems such as lack of market information, use of technology, human resources and the high cost of electricity.",
      "Hence, Unido Cambodia representative Sok Narin said through the cooperation, the organisation will be able to work closely with the private sector to develop SMEs in the Kingdom and help them achieve sustainable growth.",
      "Source: Phnom Penh Post"
    ],
    "date": "August 20, 2018",
    "thumbnail": "../assets/images/news/a-groundbreaking-ceremony-takes-place-for-a-government-endorsed-affordable-housing-project-in-kandal-province-last-year.-sreng-meng-srun.jpg",
    "images": []
  },
  {
    "titleId": "wbg002",
    "title": "WorldBridge to Open First SME Industrial Park",
    "des": [
      "The first industrial park for small and medium enterprises in the Kingdom will open this October in Kandal province, just 12 kilometres from the centre of Phnom Penh.",
      "The SME Eco Park, referred to also as SME Cluster Zone by the developer, is located on four hectares of land in S’ang district and will focus on food and beverage processing, according to Worldbridge Group, the company behind the project.",
      "Companies in the industrial park will have access to packaging and logistics services, said Sear Rithy, chairman of Worldbridge. He added that they will have greater access to funds, markets and labour.",
      "“We will also provide training courses to young entrepreneurs who are starting their own businesses,” Mr Rithy said.",
      "“We will create SME clusters in every corner of Cambodia that has raw materials,” he said, adding that they are targeting Sihanoukville to build the next park.",
      "Mr Rithy said the SME cluster is smaller than a special economic zone, but that there is the possibility of expanding it in the future if necessary.",
      "Construction of the SME Eco Park began at the beginning of last year, following the signing of a memorandum of understanding between Worldbridge and the Ministry of Industry and Handicraft in late 2016, he said.",
      "Mr Rithy explained that his SME park will serve as the pilot for a programme announced by the Ministry of Industry and Handicraft in 2016 that seeks to build similar SME-focused industrial parks in every province to enhance domestic manufacturing and boost production standards.",
      "Minister of Industry Cham Prasidh said previously that the success of Worldbridge’s SME Eco Park is crucial to determine whether the ministry’s own SME park initiative will be successful.",
      "“We believe the parks will help Cambodian products reach more regional and global markets,” he said. “This would largely come from adding value to the country’s rich agricultural materials, but this must be done complying with international food standards,” the minister said.",
      "According to the Ministry of Industry and Handicraft, there are 530,000 SMEs in Cambodia, 97 percent of which have fewer than 10 employees and are thus classified as micro-enterprises.",
      "Source: Khmer Times"
    ],
    "date": "June 27, 2018",
    "thumbnail": "../assets/images/news/worldbridge-open-first-SME-industrial-park.jpg",
    "images": []
  },
  {
    "titleId": "wbg001",
    "title": "Oxley WorldBridge to Launch Luxury Residential Project",
    "des": [
      "WorldBridge chairman Sear Rithy is taking a glass half-full approach to Phnom Penh’s booming yet equally risky property market, with the oknha revealing details of a new luxury villa project that will be built along National Road 1.",
      "Rithy told Post Property earlier this week that the project will kick off construction concurrently with the sales process at the end of this month.",
      "The project, located on 3.6 hectares of land along National Road 1 in the Chbar Ampov district, is tipped to consist of more than 200 houses with prices starting from $300,000.",
      "Called The Palm, the project is a joint venture between WorldBridge and Singapore’s Oxley Holdings.",
      "The Palm marks the third project being developed by the venture, following the success of The Bridge and The Peak developments.",
      "Rithy said the vision for The Palm was a unique one, with the dwellings resembling resort-like houses. The complex, set to cost $30 million, will include an artificial beach, Rithy said.",
      "“This project is based on a vision for a unique development and it is different from the others,” he added.",
      "Rithy said he was not concerned about building a residential development in an already heavily supplied market, stating that the favourable location of the project would give it an upper edge.",
      "“Sitting along National Road 1 is a very favourable territory for living after the construction of this road is finished,” Rithy said.",
      "A spokesman for Oxley Holdings did not respond to additional questions regarding the project from before publication.",
      "Chrek Soknim, CEO of Century 21 Mekong, said areas along National Road 1 were emerging as popular zones for residential living, citing Borey Peng Hout as one dwelling that was attracting wealthy citizens.",
      "“The market for residential houses is now back on its feet,” Soknim said.",
      "Housing Development Association of Cambodia president Ly Hour agreed that areas along National Road 1 were well primed for residential development.",
      "He added: “The sales of houses is getting better now as customers are no longer concerned with the election and this is a good thing for everyone.”",
      "Source: Phnom Penh Post"
    ],
    "date": "July 13, 2017",
    "thumbnail": "../assets/images/news/oknha-sear-rithy.jpg",
    "images": []
  }
]
